init.org
:PROPERTIES:
:TOC:      :include all :force ((nothing)) :ignore ((nothing)) :local ((nothing))
:END:
#+title: Emacs Init
#+author: mattiasdrp
#+date: <2022-08-17 Wed>
#+language: en_US
#+property: header-args :results silent :exports code :tangle yes

#+keywords: Emacs

Literate configuration for init.el.

* Table of Contents
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#header][Header]]
- [[#global-options][Global options]]
  - [[#disable-warnings][Disable warnings]]
  - [[#disableenable-features][Disable/Enable features]]
  - [[#set-useful-variables][Set useful variables]]
    - [[#init-file][Init file]]
    - [[#load-custom-file][Load custom file]]
  - [[#maximize-and-fullscreen-at-start-up][Maximize and fullscreen at start-up]]
  - [[#revert-early-init][Revert early-init]]
  - [[#gc-when-emacs-is-idle-and-never-when-using-minibuffer][GC when emacs is idle and never when using minibuffer]]
  - [[#load-functions][Load functions]]
  - [[#change-frame-title-format][Change frame title format]]
  - [[#ask-yn-instead-of-yesno][Ask y/n instead of yes/no]]
  - [[#default-values][Default values]]
  - [[#prettifying][Prettifying]]
  - [[#revert-files-when-they-changed][Revert files when they changed]]
  - [[#show-parenthesis][Show parenthesis]]
  - [[#other-useful-global-modes][Other useful global modes]]
  - [[#add-some-files-to-text-mode][Add some files to text-mode]]
  - [[#delete-whitespace][Delete whitespace]]
  - [[#set-package-archives][Set package archives]]
  - [[#initialize-packages][Initialize packages]]
  - [[#install-and-set-use-package][Install and set use-package]]
  - [[#auto-update-packages][Auto update packages]]
  - [[#no-littering][No littering]]
- [[#requirements][Requirements]]
- [[#constants-and-variables][Constants and variables]]
- [[#packages-initialization-and-configuration][Packages initialization and configuration]]
- [[#history-and-prescience][History and prescience]]
  - [[#prescient][Prescient]]
  - [[#savehist][Savehist]]
- [[#wsl-specific][WSL Specific]]
- [[#fonts-and-character-encoding][Fonts and character encoding]]
  - [[#set-environment-to-utf-8][Set Environment to UTF-8]]
  - [[#all-the-icons-and-material-icons-for-specific-range][All the icons and material icons for specific range]]
  - [[#ligatures][Ligatures]]
  - [[#ansi-color][Ansi color]]
- [[#keybindings][Keybindings]]
  - [[#general][General]]
  - [[#which-key][Which-key]]
  - [[#selected][Selected]]
  - [[#disabled-god-mode][DISABLED: God mode]]
- [[#general-utilities][General Utilities]]
  - [[#cheat-sheet][Cheat Sheet]]
  - [[#crux][Crux]]
  - [[#delete-block][Delete block]]
  - [[#discover-my-major][Discover my major]]
  - [[#easy-kill][Easy-kill]]
  - [[#flyspell][Flyspell]]
    - [[#flyspell-correct][Flyspell correct]]
  - [[#fringe-helper][Fringe helper]]
  - [[#highlight-symbol][Highlight symbol]]
  - [[#hydra][Hydra]]
  - [[#keycast][Keycast]]
  - [[#multiple-cursors][Multiple cursors]]
  - [[#hide-region][Hide region]]
  - [[#whitespace][Whitespace]]
- [[#prog-mode-utilities][Prog mode utilities]]
  - [[#disabled-highlight-indent-guides][DISABLED: Highlight indent guides]]
  - [[#apheleia][Apheleia]]
  - [[#dap][DAP]]
  - [[#dumb-jump][Dumb jump]]
  - [[#flycheck][Flycheck]]
    - [[#main-mode][Main mode]]
    - [[#quick-peek][Quick Peek]]
    - [[#flycheck-inline][Flycheck inline]]
  - [[#hideshow][Hideshow]]
  - [[#projectile][Projectile]]
  - [[#separedit][Separedit]]
  - [[#treemacs][Treemacs]]
- [[#git][Git]]
  - [[#magit][Magit]]
  - [[#magit-todos][Magit todos]]
    - [[#highlight-todo][Highlight todo]]
  - [[#diff-hl][Diff hl]]
  - [[#git-commit][Git commit]]
  - [[#git-messenger][Git messenger]]
  - [[#git-timemachine][Git timemachine]]
  - [[#git-modes][Git modes]]
  - [[#ghub][Ghub]]
- [[#windowsframe-management][Windows/Frame management]]
  - [[#winner][Winner]]
  - [[#ace-window][Ace window]]
  - [[#visual-fill-column][Visual fill column]]
- [[#completion][Completion]]
  - [[#vertico][Vertico]]
    - [[#main-mode][Main mode]]
    - [[#vertico-directory][Vertico directory]]
    - [[#vertico-multiform][Vertico multiform]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
  - [[#emacs-configuration-for-minibuffers-and-completion][Emacs configuration for minibuffers and completion]]
  - [[#orderless][Orderless]]
  - [[#marginalia][Marginalia]]
  - [[#yasnippet][Yasnippet]]
  - [[#company][Company]]
    - [[#company-math][Company math]]
    - [[#company-web][Company web]]
    - [[#company-box][Company box]]
    - [[#company-prescient][Company prescient]]
    - [[#company-quickhelp][Company quickhelp]]
- [[#gui][GUI]]
  - [[#themes-etc][Themes etc]]
    - [[#doom-theme][Doom theme]]
  - [[#mode-line][Mode-line]]
    - [[#anzu][Anzu]]
    - [[#doom-modeline][Doom modeline]]
    - [[#minions][Minions]]
  - [[#outline-major-and-minor-modes][Outline (major and minor modes)]]
    - [[#major-mode][Major mode]]
    - [[#minor-mode][Minor mode]]
    - [[#outshine][Outshine]]
    - [[#pretty-outlines][Pretty outlines]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#rainbow-delimiters][Rainbow delimiters]]
  - [[#pulsar][Pulsar]]
- [[#org-mode][Org mode]]
  - [[#org-ref][Org ref]]
  - [[#org-bullets][Org bullets]]
  - [[#org-inline-pdf][Org inline pdf]]
  - [[#calfw][Calfw]]
  - [[#calfw-org][Calfw org]]
  - [[#disabled-org-gcal][DISABLED: Org gcal]]
  - [[#org-super-agenda][Org super agenda]]
  - [[#org-appear][Org appear]]
  - [[#org-roam][Org roam]]
  - [[#org-make-toc][Org make toc]]
- [[#lsp][LSP]]
  - [[#main-mode][Main mode]]
  - [[#lsp-ui][Lsp ui]]
  - [[#lsp-treemacs][Lsp treemacs]]
- [[#tree-sitter][Tree sitter]]
  - [[#tree-sitter-folding][Tree sitter folding]]
- [[#programming-languages][Programming languages]]
  - [[#dataconfig-formats][Data/Config formats]]
    - [[#conf-mode][Conf mode]]
    - [[#json][Json]]
    - [[#dune-files][Dune files]]
    - [[#makefile][Makefile]]
  - [[#elisp][Elisp]]
  - [[#fsharp][Fsharp]]
  - [[#kotlin][Kotlin]]
  - [[#latex][LaTeX]]
  - [[#markdown][Markdown]]
    - [[#main-mode][Main mode]]
    - [[#markdown-toc][Markdown toc]]
    - [[#pandoc][Pandoc]]
  - [[#ocaml][OCaml]]
    - [[#useful-functions][Useful functions]]
    - [[#main-mode][Main mode]]
    - [[#tuareg-menhir][Tuareg Menhir]]
    - [[#dune-commands][Dune commands]]
  - [[#pdf-files][Pdf files]]
    - [[#saveplace-in-pdf][Saveplace in pdf]]
  - [[#python][Python]]
    - [[#main-mode][Main mode]]
    - [[#pyvenv][Pyvenv]]
    - [[#lsp-pyright][Lsp pyright]]
  - [[#reason][Reason]]
  - [[#rust][Rust]]
  - [[#web-modes][Web modes]]
    - [[#main-mode][Main mode]]
    - [[#css-mode][CSS mode]]
- [[#miscellaneous][Miscellaneous]]
  - [[#disabled-spotify][DISABLED: Spotify]]
- [[#end][End]]
:END:

* Header
:PROPERTIES:
:CUSTOM_ID: header
:END:

#+begin_src emacs-lisp
  ;;; init.el --- Emacs init -*- lexical-binding: t -*-
  ;;

  ;; Copyright (c) 2022 mattiasdrp and contributors.

  ;; Author: mattiasdrp
  ;; Maintainer: mattiasdrp <https://github.com/mattiasdrp>
  ;; Created: 17 august 2022
  ;; Version: 1.0
  ;; Licence: MIT
  ;; Keywords: emacs, init, convenience, configuration
  ;; URL: https://github.com/mattiasdrp/pokemacs

  ;;; Commentary:

  ;; This file IS NOT intended to be edited! It was generated by init.org.
  ;; If you want to change it, edit init.org then M-x org-babel-tangle

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;; Code:

#+end_src

* Global options
:PROPERTIES:
:CUSTOM_ID: global-options
:END:

** Disable warnings
:PROPERTIES:
:CUSTOM_ID: disable-warnings
:END:


#+begin_src emacs-lisp
  (setq byte-compile-warnings '(cl-functions))
#+end_src

** Disable/Enable features
:PROPERTIES:
:CUSTOM_ID: disableenable-features
:END:

This is a list of custom variables that allow to enable/disable features. If you want to change them, ~M-x customize-variable <custom_variable>~ will change its value in [[file:custom.el][custom.el]] allowing to maintain your own [[file:custom.el][custom.el]] file that should never be updated by me. Don't enable or disable features in this file or it will make updating it harder.

#+begin_src emacs-lisp
  (defgroup mdrp-packages nil
    "Pokemacs packages."
    :group 'package
    :tag "Packages options group")

  (defcustom use-spotify nil
    "If non-nil, uses the spotify packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-latex nil
    "If non-nil, uses the LaTeX packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-org-roam nil
    "If non-nil, uses Org roam"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-magit-todos nil
    "If non-nil, show todos in the current project in magit buffer"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-rust nil
    "If non-nil, uses the rust packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-ocaml t
    "If non-nil, uses the OCaml packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-reason t
    "If non-nil, uses the Reason packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-python nil
    "If non-nil, uses the Python packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-fsharp nil
    "If non-nil, uses the F# packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-kotlin nil
    "If non-nil, uses the Kotlin packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-web nil
    "If non-nil, uses the web packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-markdown t
    "If non-nil, uses the markdown packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-pandoc t
    "If non-nil, uses the pandoc packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-company t
    "If non-nil, uses the company packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-treemacs t
    "If non-nil, uses the treemacs packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-god nil
    "If non-nil, uses the god (mode) packages"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-visual-fill nil
    "If non-nil, fill the frame when there's only one"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom use-maximize nil
    "If non-nil, maximize emacs at startup"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom org-agenda-start nil
    "Theme to load"
    :group 'mdrp-packages
    :type 'boolean)

  (defcustom doom-theme 'doom-one
    "Theme to load"
    :group 'mdrp-packages
    :type 'symbol)

#+end_src

** Set useful variables
:PROPERTIES:
:CUSTOM_ID: set-useful-variables
:END:

*** Init file
:PROPERTIES:
:CUSTOM_ID: init-file
:END:

#+begin_src emacs-lisp
  (setq user-init-file (or load-file-name (buffer-file-name)))
  (setq user-emacs-directory (file-name-directory user-init-file))

#+end_src

*** Load custom file
:PROPERTIES:
:CUSTOM_ID: load-custom-file
:END:

#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
#+end_src

** Maximize and fullscreen at start-up
:PROPERTIES:
:CUSTOM_ID: maximize-and-fullscreen-at-start-up
:END:

#+begin_src emacs-lisp
  (when use-maximize
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))
#+end_src

** Revert early-init
:PROPERTIES:
:CUSTOM_ID: revert-early-init
:END:

The default value to use for ~gc-cons-threshold~.
If you experience freezing, decrease this.
If you experience stuttering, increase this.

#+begin_src emacs-lisp
  (defvar better-gc-cons-threshold 67108864) ; 64mb
#+end_src

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold 67108864)
              (setq file-name-handler-alist file-name-handler-alist-original)
              (makunbound 'file-name-handler-alist-original)))
#+end_src

