init.el
;;; init.el --- Emacs init -*- lexical-binding: t -*-
;;

;; Copyright (c) 2022 mattiasdrp and contributors.

;; Author: mattiasdrp
;; Maintainer: mattiasdrp <https://github.com/mattiasdrp>
;; Created: 17 august 2022
;; Version: 1.0
;; Licence: MIT
;; Keywords: emacs, init, convenience, configuration
;; URL: https://github.com/mattiasdrp/pokemacs

;;; Commentary:

;; This file IS NOT intended to be edited! It was generated by init.org.
;; If you want to change it, edit init.org then M-x org-babel-tangle

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Code:

(setq byte-compile-warnings '(cl-functions))

(defgroup mdrp-packages nil
  "Pokemacs packages."
  :group 'package
  :tag "Packages options group")

(defcustom use-spotify nil
  "If non-nil, uses the spotify packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-latex nil
  "If non-nil, uses the LaTeX packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-org nil
  "If non-nil, uses the Org packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-magit-todos nil
  "If non-nil, show todos in the current project in magit buffer"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-rust nil
  "If non-nil, uses the rust packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-ocaml t
  "If non-nil, uses the OCaml packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-reason t
  "If non-nil, uses the Reason packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-python nil
  "If non-nil, uses the Python packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-fsharp nil
  "If non-nil, uses the F# packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-kotlin nil
  "If non-nil, uses the Kotlin packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-web nil
  "If non-nil, uses the web packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-markdown t
  "If non-nil, uses the markdown packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-pandoc t
  "If non-nil, uses the pandoc packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-company t
  "If non-nil, uses the company packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-treemacs t
  "If non-nil, uses the treemacs packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-god nil
  "If non-nil, uses the god (mode) packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-rainbow nil
  "If non-nil, uses the rainbow packages"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-visual-fill nil
  "If non-nil, fill the frame when there's only one"
  :group 'mdrp-packages
  :type 'boolean)

(defcustom use-maximize nil
"If non-nil, maximize emacs at startup"
:group 'mdrp-packages
:type 'boolean)

(defcustom doom-theme 'doom-one
"Theme to load"
:group 'mdrp-packages
:type 'symbol)

(setq user-init-file (or load-file-name (buffer-file-name)))
(setq user-emacs-directory (file-name-directory user-init-file))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)

(when use-maximize
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))

(defvar better-gc-cons-threshold 67108864) ; 64mb

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold 67108864)
            (setq file-name-handler-alist file-name-handler-alist-original)
            (makunbound 'file-name-handler-alist-original)))

(add-hook 'emacs-startup-hook
          (lambda ()
