init.org
** GC when emacs is idle and never when using minibuffer
:PROPERTIES:
:CUSTOM_ID: gc-when-emacs-is-idle-and-never-when-using-minibuffer
:END:

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
            (lambda ()
              (if (boundp 'after-focus-change-function)
                  (add-function :after after-focus-change-function
                                (lambda ()
                                  (unless (frame-focus-state)
                                    (garbage-collect))))
                (add-hook 'after-focus-change-function 'garbage-collect))
              (defun gc-minibuffer-setup-hook ()
                (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

              (defun gc-minibuffer-exit-hook ()
                (garbage-collect)
                (setq gc-cons-threshold better-gc-cons-threshold))

              (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
              (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))
#+end_src

** Load functions
:PROPERTIES:
:CUSTOM_ID: load-functions
:END:

#+begin_src emacs-lisp
  (defun update-to-load-path (folder)
    "Update FOLDER and its subdirectories to `load-path'."
    (let ((base folder))
      (unless (member base load-path)
        (add-to-list 'load-path base))
      (dolist (f (directory-files base))
        (let ((name (concat base "/" f)))
          (when (and (file-directory-p name)
                     (not (equal f ".."))
                     (not (equal f ".")))
            (unless (member base load-path)
              (add-to-list 'load-path name)))))))

  (update-to-load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

** Change frame title format
:PROPERTIES:
:CUSTOM_ID: change-frame-title-format
:END:

#+begin_src emacs-lisp
(setq frame-title-format '(buffer-file-name "%b (%f)" "%b"))
#+end_src

** Ask y/n instead of yes/no
:PROPERTIES:
:CUSTOM_ID: ask-yn-instead-of-yesno
:END:

#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** Default values
:PROPERTIES:
:CUSTOM_ID: default-values
:END:

#+begin_src emacs-lisp
    (setq-default
     ;; Don't lock files, I know what I'm doing
     create-lockfiles nil
     ;; Always kill compilation process before starting another
     compilation-always-kill t
     ;; Save all buffers before compiling
     compilation-ask-about-save nil
     ;; TODO: Not exactly sure what this does
     compilation-context-lines t
     ;; TODO: Not exactly sure what this does
     compilation-error-screen-columns t
     ;; Scroll to the first error in the compilation buffer
     compilation-scroll-output 'first-
     ;; Number of lines in a compilation window
     compilation-window-height 12
     ;; Don't put anything in the scratch buffer
     initial-scratch-message ""
     ;; Use the clipboard too when cutting and pasting
     select-enable-clipboard t
     ;; Turn font lock mode for all mods that allow it
     ;; TODO: Specify a list when we'll start using tree-sitter
     font-lock-global-modes t
     ;; Never insert tabs when indenting (default is now to always use space)
     indent-tabs-mode nil
     ;; I know emacs, I really don't need the startup-screen
     inhibit-startup-screen t
     )
#+end_src

#+begin_src emacs-lisp
  (setq
   ;; Ask before killing emacs
   confirm-kill-emacs 'y-or-n-p
   ;; Move point by visual lines
   line-move-visual t
   ;; Highlight the location of the next-error in the source buffer
   next-error-highlight t
   ;; Highlight the locus indefinitely until some other locus replaces it.
   next-error-highlight-no-select t
   ;; Add a newline automatically at the end of the file upon save.
   require-final-newline t
   ;; Briefly move cursor to the matching open-paren
   ;; even if it is not visible in the window.
   blink-matching-paren 'jump-offscreen
   ;; Show matching parenthesis even for comments
   blink-matching-paren-dont-ignore-comments t
   ;; Show matching parentheses even when on screen
   blink-matching-paren-on-screen t
   ;; Show column with line in the modeline
   column-number-mode t
   ;; Full comments per line
   comment-style 'indent
   ;; I don't need scroll bars
   scroll-bar-mode nil
   ;; TODO/ Not sure why I'm using it
   sentence-end-double-space nil
   ;; Long lines will span on a continuation line (makes the whole line visible)
   truncate-lines nil
   ;; Flash the screen
   visible-bell t
   ;; Turn Off Cursor Alarms
   ring-bell-function 'ignore
   ;; Save backup files in a .backup directory
   backup-directory-alist `(("." . ,(expand-file-name ".backup" user-emacs-directory)))
   ;; Show Keystrokes in Progress Instantly
   echo-keystrokes 0.1
   )
#+end_src

 # TODO: Change ansi color COLORS "#424242" "#EF9A9A" "#C5E1A5" "#FFEE58" "#64B5F6" "#E1BEE7" "#80DEEA" "#E0E0E0"]

** Prettifying
:PROPERTIES:
:CUSTOM_ID: prettifying
:END:

Enable prettifying everywhere

#+begin_src emacs-lisp
  (global-prettify-symbols-mode t)
  (prettify-symbols-mode)
#+end_src

When the cursor in on a prettified symbol, unprettify it

#+begin_src emacs-lisp
  (setq prettify-symbols-unprettify-at-point 1)
#+end_src

** Revert files when they changed
:PROPERTIES:
:CUSTOM_ID: revert-files-when-they-changed
:END:

This allows to let emacs revert files automatically if they were not changed directly in a buffer (log files for example)

#+begin_src emacs-lisp
  (global-auto-revert-mode t)
  (auto-revert-mode t)
#+end_src

** Show parenthesis
:PROPERTIES:
:CUSTOM_ID: show-parenthesis
:END:

Not the same as ~blink-matching-paren*~ that triggers when you close a parenthesis. This will show the matching parenthesis when your cursor is on an open or closed parenthesis.

#+begin_src emacs-lisp
  (show-paren-mode 1)
#+end_src

The available styles are
~'parenthesis~: show the matching parenthesis
~'expression~: show the entire expression enclosed by the parenthesis
~'mixed~: show the matching paren if it is visible, and the expression
otherwise

Since this is highly user dependent (I see you @thriim), the variable ~show-paren-style~ should be set in [[file:custom.el][custom.el]]

** Other useful global modes
:PROPERTIES:
:CUSTOM_ID: other-useful-global-modes
:END:

- Display line numbers in the fringe
  #+begin_src emacs-lisp
    (global-display-line-numbers-mode 1)
  #+end_src
- Save the place of the cursor when exiting the buffer
  #+begin_src emacs-lisp
    (save-place-mode 1)
  #+end_src
- Replace selection when writing
  #+begin_src emacs-lisp
    (delete-selection-mode t)
  #+end_src
- So Long mitigates slowness due to extremely long lines.
/Currently available in Emacs master branch only!/
  #+begin_src emacs-lisp
    (when (fboundp 'global-so-long-mode)
      (global-so-long-mode))
  #+end_src

** Add some files to text-mode
:PROPERTIES:
:CUSTOM_ID: add-some-files-to-text-mode
:END:

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.in\\'" . text-mode))
(add-to-list 'auto-mode-alist '("\\.out\\'" . text-mode))
(add-to-list 'auto-mode-alist '("\\.args\\'" . text-mode))
#+end_src

** Delete whitespace
:PROPERTIES:
:CUSTOM_ID: delete-whitespace
:END:

#+begin_src emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

** Set package archives
:PROPERTIES:
:CUSTOM_ID: set-package-archives
:END:

#+begin_src emacs-lisp
  (setq package-archives '(("melpa" . "http://melpa.org/packages/")
                           ("elpa" . "http://elpa.gnu.org/packages/")))
#+end_src

** Initialize packages
:PROPERTIES:
:CUSTOM_ID: initialize-packages
:END:

#+begin_src emacs-lisp
  (unless (bound-and-true-p package--initialized)
    (setq package-enable-at-startup nil)          ; To prevent initializing twice
    (package-initialize))
#+end_src

** Install and set use-package
:PROPERTIES:
:CUSTOM_ID: install-and-set-use-package
:END:

#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-and-compile
    (setq use-package-verbose t)
    (setq use-package-expand-minimally t)
    (setq use-package-compute-statistics t)
    (setq use-package-enable-imenu-support t))

  (eval-when-compile
    (require 'use-package)
    (require 'bind-key))
#+end_src
Will be used to download non-emacs packages needed by emacs packages

#+begin_src emacs-lisp
  (use-package use-package-ensure-system-package :ensure t)
#+end_src

** Auto update packages
:PROPERTIES:
:CUSTOM_ID: auto-update-packages
:END:

Automatic updating of packages (you can customize ~auto-update-package-interval~ which default value is ~7 days~)

#+begin_src emacs-lisp
  (use-package auto-package-update
    :ensure t
    :custom
    (auto-package-update-show-preview t)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-delete-old-version t)
    )
#+end_src

** No littering
:PROPERTIES:
:CUSTOM_ID: no-littering
:END:

Stop creating files everywhere and put them all in a single place

#+begin_src emacs-lisp
  (use-package no-littering
    :ensure t)
#+end_src

And by the way, put the backup files in the same directory to prevent polluting the my project directories

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "backups/") t)))
#+end_src

And just save the visited file, don't create a ~#file#~ while waiting for it to be saved

#+begin_src emacs-lisp
  (auto-save-visited-mode 1)
  (setq auto-save-default nil)
  (setq auto-save-timeout 600)
#+end_src

* Requirements
:PROPERTIES:
:CUSTOM_ID: requirements
:END:

#+begin_src emacs-lisp
  (require 'cl-lib)
  (require 'package)
  (require 'mdrp-functions)
#+end_src

