init.el
            (if (boundp 'after-focus-change-function)
                (add-function :after after-focus-change-function
                              (lambda ()
                                (unless (frame-focus-state)
                                  (garbage-collect))))
              (add-hook 'after-focus-change-function 'garbage-collect))
            (defun gc-minibuffer-setup-hook ()
              (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

            (defun gc-minibuffer-exit-hook ()
              (garbage-collect)
              (setq gc-cons-threshold better-gc-cons-threshold))

            (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
            (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))

(defun update-to-load-path (folder)
  "Update FOLDER and its subdirectories to `load-path'."
  (let ((base folder))
    (unless (member base load-path)
      (add-to-list 'load-path base))
    (dolist (f (directory-files base))
      (let ((name (concat base "/" f)))
        (when (and (file-directory-p name)
                   (not (equal f ".."))
                   (not (equal f ".")))
          (unless (member base load-path)
            (add-to-list 'load-path name)))))))

(update-to-load-path (expand-file-name "lisp" user-emacs-directory))

(setq frame-title-format '(buffer-file-name "%b (%f)" "%b"))

(fset 'yes-or-no-p 'y-or-n-p)

(setq-default
 ;; Don't lock files, I know what I'm doing
 create-lockfiles nil
 ;; Always kill compilation process before starting another
 compilation-always-kill t
 ;; Save all buffers before compiling
 compilation-ask-about-save nil
 ;; TODO: Not exactly sure what this does
 compilation-context-lines t
 ;; TODO: Not exactly sure what this does
 compilation-error-screen-columns t
 ;; Scroll to the first error in the compilation buffer
 compilation-scroll-output 'first-
 ;; Number of lines in a compilation window
 compilation-window-height 12
 ;; Don't put anything in the scratch buffer
 initial-scratch-message ""
 ;; Use the clipboard too when cutting and pasting
 select-enable-clipboard t
 ;; Turn font lock mode for all mods that allow it
 ;; TODO: Specify a list when we'll start using tree-sitter
 font-lock-global-modes t
 ;; Never insert tabs when indenting (default is now to always use space)
 indent-tabs-mode nil
 ;; I know emacs, I really don't need the startup-screen
 inhibit-startup-screen t
 ;; Major mode used for the scratch buffer
 initial-major-mode 'text-mode
 )

(setq
 ;; TODO: Move this to ?
 native-comp-deferred-compilation t
 ;; Ask before killing emacs
 confirm-kill-emacs 'y-or-n-p
 ;; TODO: Move this to org
 org-directory "~/org/"
 ;; Move point by visual lines
 line-move-visual t
 ;; Highlight the location of the next-error in the source buffer
 next-error-highlight t
 ;; Highlight the locus indefinitely until some other locus replaces it.
 next-error-highlight-no-select t
 ;; Add a newline automatically at the end of the file upon save.
 require-final-newline t
 ;; Briefly move cursor to the matching open-paren
 ;; even if it is not visible in the window.
 blink-matching-paren 'jump-offscreen
 ;; Show matching parenthesis even for comments
 blink-matching-paren-dont-ignore-comments t
 ;; Show matching parentheses even when on screen
 blink-matching-paren-on-screen t
 ;; Show column with line in the modeline
 column-number-mode t
 ;; Full comments per line
 comment-style 'indent
 ;; I don't need scroll bars
 scroll-bar-mode nil
 ;; TODO/ Not sure why I'm using it
 sentence-end-double-space nil
 ;; Long lines will span on a continuation line (makes the whole line visible)
 truncate-lines nil
 ;; Flash the screen
 visible-bell t
 ;; Turn Off Cursor Alarms
 ring-bell-function 'ignore
 ;; Save backup files in a .backup directory
 backup-directory-alist `(("." . ,(expand-file-name ".backup" user-emacs-directory)))
 ;; Show Keystrokes in Progress Instantly
 echo-keystrokes 0.1
 )

(global-prettify-symbols-mode t)
(prettify-symbols-mode)

(setq prettify-symbols-unprettify-at-point 1)

(global-auto-revert-mode t)
(auto-revert-mode t)

(show-paren-mode 1)

;; Display line numbers in the fringe
(global-display-line-numbers-mode 1)
;; Save the place of the cursor when exiting the buffer
(save-place-mode 1)
;; Replace selection when writing
(delete-selection-mode t)
;; So Long mitigates slowness due to extremely long lines.
;; Currently available in Emacs master branch *only*!
(when (fboundp 'global-so-long-mode)
  (global-so-long-mode))

(add-to-list 'auto-mode-alist '("\\.in\\'" . text-mode))
(add-to-list 'auto-mode-alist '("\\.out\\'" . text-mode))
(add-to-list 'auto-mode-alist '("\\.args\\'" . text-mode))

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(setq package-archives '(("melpa" . "http://melpa.org/packages/")
                         ("elpa" . "http://elpa.gnu.org/packages/")))

(unless (bound-and-true-p package--initialized)
  (setq package-enable-at-startup nil)          ; To prevent initializing twice
  (package-initialize))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-and-compile
  (setq use-package-verbose t)
  (setq use-package-expand-minimally t)
  (setq use-package-compute-statistics t)
  (setq use-package-enable-imenu-support t))

(eval-when-compile
  (require 'use-package)
  (require 'bind-key))

(use-package use-package-ensure-system-package :ensure t)

(use-package auto-package-update
  :ensure t
  :custom
  (auto-package-update-show-preview t)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-delete-old-version t)
  )

(use-package no-littering
  :ensure t)

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "backups/") t)))

(auto-save-visited-mode 1)
(setq auto-save-default nil)
(setq auto-save-timeout 600)

(require 'cl-lib)
(require 'package)
(require 'mdrp-functions)
