init.org
** [[https://github.com/noctuid/general.el][General]]
:PROPERTIES:
:CUSTOM_ID: general
:END:

#+begin_src emacs-lisp
  (use-package general
    :demand t
    :ensure t
    :init
    (general-unbind
      "C-o"
      "C-f"
      "C-z"
      "C-x C-z"
      "M-z"
      "M-m"
      "M-l"
      "M-h"
      "M-/"
      "M-l"
      "M-f"
      )
    (general-define-key
     [remap indent-for-tab-command]       'company-indent-or-complete-common
     [remap kill-buffer]                  'kill-this-buffer
     [remap ispell-word]                  'flyspell-correct-at-point
     ;; Prefixed by C
     "C-x C-1"                 'delete-other-windows
     "C-x C-2"                 'split-window-below
     "C-x C-3"                 'split-window-right
     "C-x C-0"                 'delete-window

     "C-x &"                   'delete-other-windows
     "C-x é"                   'split-window-below
     "C-x \""                  'split-window-right
     "C-x à"                   'delete-window

     "C-x C-l"                 'toggle-truncate-lines
     "C-="                     'text-scale-increase
     "C-+"                     'text-scale-increase
     "C--"                     'text-scale-decrease
     "C-c h b"                 'describe-personal-keybindings
     ;; Create new line contextualised by the previous one
     ;; (will add a comment if in comment mode for example)
     "C-<return>"              'default-indent-new-line
     ;; emacs autocompletion (not like company)
     "C-<tab>"                 'dabbrev-expand
     "C-n"                     'next-error
     "C-p"                     'previous-error
     ;; windmove
     "C-x <left>"              'windmove-left
     "C-x <right>"             'windmove-right
     "C-x <up>"                'windmove-up
     "C-x <down>"              'windmove-down
     "C-x C-o"                 'ace-window

     ;; rotate buffers and window arrangements
     "C-c r w"                 'rotate-window
     "C-c r l"                 'rotate-layout

     ;; Prefixed by M
     "M-u"                     'upcase-dwim

     "M-J"                     (lambda () (interactive) (mdrp/resize-window t 5))
     "M-L"                     (lambda () (interactive) (mdrp/resize-window t -5))
     "M-I"                     (lambda () (interactive) (mdrp/resize-window nil 5))
     "M-K"                     (lambda () (interactive) (mdrp/resize-window nil -5))
     ;; Custom comment overwriting comment-dwim key binding
     "M-;"                     'mdrp/comment-eclipse
     "M-p"                     'backward-paragraph
     "M-<f1>"                  'kill-this-buffer
     "M-Q"                     'unfill-paragraph

     "M-+"                     'hs-toggle-hiding
     "M-*"                     'hs-show-all

     ;; Function keys
     [f3]                      'next-match
     [(shift f3)]              'prev-match
     [f4]                      'goto-line
     [f5]                      'compile
     [f6]                      'recompile
     [f7]                      'next-error
     [f8]                      'normal-mode

     ;; Mouse
     [mouse-4]                 'down-slightly
     [mouse-5]                 'up-slightly
     )
    (general-define-key
     :prefix "M-z"
     ;; Setup shorcuts for window resize width and height
     "w"                       'mdrp/resize-window-width
     "h"                       'mdrp/resize-window-height)
    (general-define-key
     :prefix "M-h"
     "d"                       'hydra-dates/body)
    (general-def minibuffer-local-map
      "C-<tab>" 'dabbrev-expand)

    (general-def flyspell-mouse-map
      "RET"                     'flyspell-correct-at-point
      [return]                  'flyspell-correct-at-point
      ))
#+end_src

** [[https://github.com/justbur/emacs-which-key][Which-key]]
:PROPERTIES:
:CUSTOM_ID: which-key
:END:

# TODO: Move major mode key based replacements to the major modes

Useful packages that allows to see the possible keys after starting a combination of keys.

#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :init (which-key-mode)
    :config
    (which-key-add-major-mode-key-based-replacements 'markdown-mode
      "C-c TAB" "markdown/images"
      "C-c C-a" "markdown/links"
      "C-c C-c" "markdown/process"
      "C-c C-s" "markdown/style"
      "C-c C-t" "markdown/header"
      "C-c C-x" "markdown/structure"
      "C-c m" "markdown/personal")
    (which-key-add-major-mode-key-based-replacements 'web-mode
      "C-c C-a" "web/attributes"
      "C-c C-b" "web/blocks"
      "C-c C-d" "web/dom"
      "C-c C-e" "web/element"
      "C-c C-t" "web/tags")
    (which-key-setup-side-window-bottom)
    (setq which-key-sort-order 'which-key-key-order-alpha
          which-key-side-window-max-width 0.33
          which-key-idle-delay 0.1)
    :custom
    (which-key-separator " ")
    (which-key-prefix-prefix "+")
    )
#+end_src

** [[https://github.com/Kungsgeten/selected.el][Selected]]
:PROPERTIES:
:CUSTOM_ID: selected
:END:

#+begin_src emacs-lisp
  (use-package selected
    :ensure t
    :init (selected-global-mode)
    :general
    (:keymaps 'selected-keymap
              ;; "C-?"                     'hydra-selected/body
              "<"                       'mc/mark-previous-like-this
              ">"                       'mc/mark-next-like-this
              "C-<"                     'mc/unmark-previous-like-this
              "C->"                     'mc/unmark-next-like-this
              "M-<"                     'mc/skip-to-previous-like-this
              "M->"                     'mc/skip-to-next-like-this
              "C-c >"                   'mc/edit-lines
              "M-c"                     'capitalize-dwim
              "M-d"                     'downcase-dwim
              "M-u"                     'upcase-dwim
              "C-f"                     'fill-region
              "C-q"                     'selected-off
              "C-s r"                   'reverse-region
              "C-s s"                   'sort-lines
              "C-s w"                   'mdrp/sort-words
              "C-<return>"              'hide-region-hide
              "C-p"                     '(hide-region-pin :which-key "Pins the selected region on top of the current window")))
#+end_src

** DISABLED: [[https://github.com/emacsorphanage/god-mode][God mode]]
:PROPERTIES:
:CUSTOM_ID: disabled-god-mode
:END:

This mode allows to switch between a mode where modifier keys are not used (~C-key~ is replaced by ~key~ and ~M-key~ by ~g key~. However, in my current config I often have ~C-key key'~ bindings and I would need to rebind them to ~C-key C-key'~ to have a seemless experience with this mode and I didn't find the need for it as of now.

#+begin_src emacs-lisp
  (use-package god-mode
    :disabled
    :init
    (setq god-mode-enable-function-key-translation nil)
    :config
    (defun my-god-mode-update-modeline ()
      (cond (god-local-mode (progn
                              (set-face-background 'mode-line "#e9e2cb")
                              (set-face-foreground 'mode-line "black")
                              (set-face-background 'mode-line-inactive "#e9e2cb")
                              (set-face-foreground 'mode-line-inactive "black")
                              ))
            (t (progn
                 (set-face-background 'mode-line "#0a2832")
                 (set-face-foreground 'mode-line "white")
                 (set-face-background 'mode-line-inactive "#0a2832")
                 (set-face-foreground 'mode-line-inactive "white")
                 ))))
    (add-hook 'god-mode-enabled-hook #'my-god-mode-update-modeline)
    (add-hook 'god-mode-disabled-hook #'my-god-mode-update-modeline)
    (setq god-exempt-major-modes nil)
    (setq god-exempt-predicates nil)
    :general (
           ("<escape>"                'god-mode-all)
           ("²"                       'god-mode-all)
           ("C-²"                     'god-mode-all)
           )
    )
#+end_src

* General Utilities
:PROPERTIES:
:CUSTOM_ID: general-utilities
:END:

This part will load packages that are useful for emacs and are not specific to modes (usually, better commands and buffer manipulations)

** [[https://github.com/mykyta-shyrin/cheatsheet][Cheat Sheet]]
:PROPERTIES:
:CUSTOM_ID: cheat-sheet
:END:

When I have the time

#+begin_src emacs-lisp
  (use-package cheatsheet
    :defer t
    )
#+end_src

