init.el

(use-package crux
  :ensure t
  :init
  (define-prefix-command 'mdrp-crux-map nil "Crux-")
  :general
  ("M-m" 'mdrp-crux-map)
  ("C-a" 'crux-move-beginning-of-line)
  ("C-x 4 t" 'crux-transpose-windows)
  ("C-x K" 'crux-kill-other-buffers)
  ("C-k" 'crux-smart-kill-line)
  (:keymaps 'mdrp-crux-map
            "w" '(crux-view-url :which-key "Open a new buffer containing the contents of URL.")
            "o" '(crux-open-with :which-key "Open visited file in default external program.")
            "e" '(crux-sudo-edit :which-key "Edit currently visited file as root.")
            "i" '(crux-insert-date :which-key "Insert a timestamp according to locale's date and time format.")
            "t" '(crux-transpose-windows :which-key "Transpose the buffers shown in two windows.")
            "j" '(crux-top-join-line :which-key "Join the current line with the line beneath it.")
            "u" '(upcase-dwim :which-key "upcase region if a region is active or word at point.")
            "d" '(downcase-dwim :which-key "downcase region if a region is active or word at point.")
            "c" '(capitalize-dwim :which-key "capitalize region if a region is active or word at point.")
            "r" '(crux-recompile-init :which-key "Byte-compile all your dotfiles again.")
            "k" '(crux-smart-kill-line :which-key "Kill to the end of the line and kill whole line on the next call.")
            "M-k" '(crux-kill-line-backwards :which-key "Kill line backwards and adjust the indentation.")
            "a" '(crux-move-beginning-of-line :which-key "Move point back to indentation/beginning (toggle) of line.")
            "s" '(crux-ispell-word-then-abbrev :which-key "Call `ispell-word', then create an abbrev for it.")
            )
  :config
  (crux-with-region-or-buffer indent-region)
  (crux-with-region-or-buffer untabify)
  (crux-with-region-or-point-to-eol kill-ring-save)
  (defalias 'rename-file-and-buffer #'crux-rename-file-and-buffer)
  )

(use-package delete-block
  :load-path "lisp/"
  :general
  ("C-d"                     'delete-block-forward)
  ("C-<backspace>"           'delete-block-backward)
  ("M-<backspace>"           'delete-block-backward)
  )

(use-package discover-my-major
  :after general
  :ensure t
  :general ("C-h C-m" 'discover-my-major))

(use-package easy-kill
  :ensure t
  :config
  (global-set-key [remap kill-ring-save] #'easy-kill)
  (global-set-key [remap mark-sexp] #'easy-mark))

(use-package flyspell
  :init
  (defun mdrp/flyspell-on-for-buffer-type ()
    "Enable Flyspell appropriately for the major mode of the current buffer.
Uses `flyspell-prog-mode' for modes derived from `prog-mode', so only strings
and comments get checked.  All other buffers get `flyspell-mode' to check
all text.  If flyspell is already enabled, does nothing."
    (interactive)
    (if (not (symbol-value flyspell-mode)) ; if not already on
        (if (derived-mode-p 'pdf-view-mode)
            (message "Flyspell off (pdf-view)")
          (progn
            (if (derived-mode-p 'prog-mode)
                (progn
                  (message "Flyspell on (code)")
                  (flyspell-prog-mode))
              ;; else
              (progn
                (message "Flyspell on (text)")
                (flyspell-mode 1)
                )
              )
            )
          )
      )
    (flyspell-buffer)
    )

  (defun mdrp/change-dict (lang)
    "Change dictionary to english. LANG is the desired language"
    (interactive "sLang: ")
    (ispell-change-dictionary lang)
    (mdrp/flyspell-on-for-buffer-type)
    )

  (defun mdrp/english-dict ()
    "Change dictionary to english."
    (interactive)
    (mdrp/change-dict "english")
    )

  (defun mdrp/french-dict ()
    "Change dictionary to french."
    (interactive)
    (mdrp/change-dict "francais")
    )

  (defun mdrp/flyspell-toggle ()
    "Turn Flyspell on if it is off, or off if it is on.  When turning on,
it uses `flyspell-on-for-buffer-type' so code-vs-text is handled appropriately."
    (interactive)
    (if (symbol-value flyspell-mode)
        (progn ; flyspell is on, turn it off
          (message "Flyspell off")
          (flyspell-mode -1))
      ;; else - flyspell is off, turn it on
      (mdrp/flyspell-on-for-buffer-type)))

  :defer t
  :hook (find-file . mdrp/flyspell-on-for-buffer-type)
  :general
  ("M-f" 'mdrp-flyspell-map)
  ("C-f" 'mdrp-flyspell-map)
  (:keymaps 'mdrp-flyspell-map
            "t" '(mdrp/flyspell-toggle :which-key "toggle flyspell mode and decides to put it in prog or text mode")
            "f" '(mdrp/french-dict :which-key "load the french dictionary")
            "e" '(mdrp/english-dict :which-key "load the english dictionary")
            )
  :ensure-system-package (aspell)
  :config
  (provide 'ispell) ; forcibly load ispell configs

  (setq ispell-list-command "--list")
  (setq ispell-dictionary "english")
  (defun flyspell-buffer-after-pdict-save (&rest _)
    (flyspell-buffer))

  (advice-add 'ispell-pdict-save :after #'flyspell-buffer-after-pdict-save)
  (define-prefix-command 'mdrp-flyspell-map nil "Flyspell-")

  (setq flyspell-issue-welcome-flag nil
        ;; Significantly speeds up flyspell, which would otherwise print
        ;; messages for every word when checking the entire buffer
        flyspell-issue-message-flag nil)

  (add-hook 'flyspell-mode-hook
            (defun +spell-inhibit-duplicate-detection-maybe-h ()
              "Don't mark duplicates when style/grammar linters are present.
e.g. proselint and langtool."
              (and (or (and (bound-and-true-p flycheck-mode)
                            (executable-find "proselint"))
                       (featurep 'langtool))
                   (setq-local flyspell-mark-duplications-flag nil))))
  (defadvice org-mode-flyspell-verify (after org-mode-flyspell-verify-hack activate)
    (let* ((rlt ad-return-value)
           (begin-regexp "^[ \t]*#\\+begin_\\(src\\|html\\|latex\\|example\\|quote\\)")
           (end-regexp "^[ \t]*#\\+end_\\(src\\|html\\|latex\\|example\\|quote\\)")
           (case-fold-search t)
           b e)
      (when ad-return-value
        (save-excursion
          (setq b (re-search-backward begin-regexp nil t))
          (if b (setq e (re-search-forward end-regexp nil t))))
        (if (and b e (< (point) e)) (setq rlt nil)))
      (setq ad-return-value rlt)))
  )

(use-package flyspell-correct
  :after flyspell
  :general
  (:keymaps 'popup-menu-keymap
            "<return>" 'popup-select)
  (:keymaps 'mdrp-flyspell-map
            "C-f" 'flyspell-correct-wrapper
            ))

(use-package fringe-helper
  :ensure t)

(use-package highlight-symbol
  :ensure t
  :general
  ("M-S-<down>"   '(highlight-symbol-next :which-key "go to the next symbol"))
  ("M-S-<up>"     '(highlight-symbol-prev :which-key "go to the previous symbol"))
  :config
  (add-hook 'prog-mode-hook #'highlight-symbol-nav-mode))
