init.org
** [[https://github.com/nschum/highlight-symbol.el][Highlight symbol]]
:PROPERTIES:
:CUSTOM_ID: highlight-symbol
:END:

Allows to go to the next/previous same symbol with ~M-S~<down>/<up>~.

#+begin_src emacs-lisp
  (use-package highlight-symbol
    :ensure t
    :init (highlight-symbol-mode)
    :general
    ("M-S-<down>"   '(highlight-symbol-next :which-key "go to the next symbol"))
    ("M-S-<up>"     '(highlight-symbol-prev :which-key "go to the previous symbol"))
    :config
    (add-hook 'prog-mode-hook #'highlight-symbol-nav-mode))
#+end_src

** [[https://github.com/abo-abo/hydra][Hydra]]
:PROPERTIES:
:CUSTOM_ID: hydra
:END:

Not using it to its full potential right now but only for useful dates:

#+begin_src emacs-lisp
  (use-package hydra
    :ensure t
    :custom
    (hydra-default-hint nil)
    :config
    (defhydra hydra-dates (:color teal)
      (concat "\n " (mdrp/hydra-heading "Dates" "Insert" "Insert with Time")
              "
   _q_ quit              _d_ short             _D_ short             ^^
   ^^                    _i_ iso               _I_ iso               ^^
   ^^                    _l_ long              _L_ long              ^^
  ")
      ("q" nil)
      ("d" mdrp/date-short)
      ("D" mdrp/date-short-with-time)
      ("i" mdrp/date-iso)
      ("I" mdrp/date-iso-with-time)
      ("l" mdrp/date-long)
      ("L" mdrp/date-long-with-time))
    )
#+end_src

** [[https://github.com/tarsius/keycast/][Keycast]]
:PROPERTIES:
:CUSTOM_ID: keycast
:END:

Needs to be manually activated. Will display all the actions made.

#+begin_src emacs-lisp
  (use-package keycast
    :ensure t
    :config
    (define-minor-mode keycast-mode
      "Show current command and its key binding in the mode line (fix for use with doom-mode-line)."
      :global t
      (if keycast-mode
          (add-hook 'pre-command-hook 'keycast--update t)
        (remove-hook 'pre-command-hook 'keycast--update)))
    (add-to-list 'global-mode-string '("" keycast-mode-line)))
#+end_src

Useful package that allows to go to the next and previous symbols at point with ~M-S-<down>~ and ~M-S-<up>~.

#+begin_src emacs-lisp
  (use-package highlight-symbol
    :ensure t
    :general
    ("M-S-<down>"   '(highlight-symbol-next :which-key "go to the next symbol"))
    ("M-S-<up>"     '(highlight-symbol-prev :which-key "go to the previous symbol"))
    :config
    (add-hook 'prog-mode-hook #'highlight-symbol-nav-mode))
#+end_src

** [[https://github.com/magnars/multiple-cursors.el][Multiple cursors]]
:PROPERTIES:
:CUSTOM_ID: multiple-cursors
:END:

Allows to have multiple cursors. There are a lot of functions provided by this mode but since I don't use this feature a lot I'd advise looking at the mode documentation. I mostly use it in conjunction with [[#selected][Selected]] (with ~>~, ~<~ and ~RET~).1

#+begin_src emacs-lisp
  (use-package multiple-cursors
    :general
    ("C-c n" 'mc/mark-next-like-this)
    ("C-c p" 'mc/mark-previous-like-this)
    ("C-c a" 'mc/mark-all-like-this)
    )
#+end_src

** Hide region
:PROPERTIES:
:CUSTOM_ID: hide-region
:END:

#+begin_src emacs-lisp
  (use-package hide-region
    :load-path "lisp/"
    )

  (use-package hide-mode-line
    :ensure t
    )
#+end_src

** [[https://www.emacswiki.org/emacs/WhiteSpace][Whitespace]]
:PROPERTIES:
:CUSTOM_ID: whitespace
:END:

Simple mode to visualize blanks

#+begin_src emacs-lisp
  (use-package whitespace
    :ensure nil
    :hook
    (prog-mode . whitespace-mode)
    (text-mode . whitespace-mode)
    :custom
    (whitespace-style '(face empty indentation::space tab trailing)))
#+end_src

* Prog mode utilities
:PROPERTIES:
:CUSTOM_ID: prog-mode-utilities
:END:

** DISABLED: [[https://github.com/DarthFennec/highlight-indent-guides][Highlight indent guides]]
:PROPERTIES:
:CUSTOM_ID: disabled-highlight-indent-guides
:END:

Show level of indentations. Can't manage to give it the proper colour and always found it distracting so putting it on hold for now.

#+begin_src emacs-lisp
  (use-package highlight-indent-guides
    :disabled
    :ensure t
    :hook (prog-mode . highlight-indent-guides-mode)
    :config
    (setq highlight-indent-guides-auto-enabled nil)
    ;; (setq highlight-indent-guides-responsive 'stack)
    (set-face-background 'highlight-indent-guides-stack-character-face "red")
    (set-face-background 'highlight-indent-guides-top-character-face "pink")
    (set-face-foreground 'highlight-indent-guides-character-face "white")
    (setq highlight-indent-guides-method 'bitmap)
    )
#+end_src

** [[https://github.com/radian-software/apheleia][Apheleia]]
:PROPERTIES:
:CUSTOM_ID: apheleia
:END:

Asynchronous code formatting after saving files.

#+begin_src emacs-lisp
  (use-package apheleia
    :ensure t
    :hook
    (tuareg-mode  . apheleia-mode)
    (caml-mode    . apheleia-mode)
    (python-mode  . apheleia-mode)
    (fsharp-mode  . apheleia-mode)
    (kotlin-mode  . apheleia-mode)
    (rustic-mode  . apheleia-mode)
    :config
    (setf (alist-get 'isort apheleia-formatters)
        '("isort" "--stdout" "-"))
    (setf (alist-get 'python-mode apheleia-mode-alist)
          '(isort black)))
#+end_src

** [[https://github.com/emacs-lsp/dap-mode][DAP]]
:PROPERTIES:
:CUSTOM_ID: dap
:END:

Debug Adapter Protocol client for emacs. Need to play a bit with it to know how to use it.

#+begin_src emacs-lisp
  (use-package dap-mode
    :ensure t
    :after lsp-mode
    :config
    (dap-auto-configure-mode))
#+end_src

** [[https://github.com/jacktasia/dumb-jump][Dumb jump]]
:PROPERTIES:
:CUSTOM_ID: dumb-jump
:END:

#+begin_src emacs-lisp
  (use-package dumb-jump
    :ensure t
    :config
    (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
    (defhydra dumb-jump-hydra (:color blue :columns 3)
      "Dumb Jump"
      ("j" dumb-jump-go "Go")
      ("o" dumb-jump-go-other-window "Other window")
      ("e" dumb-jump-go-prefer-external "Go external")
      ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
      ("i" dumb-jump-go-prompt "Prompt")
      ("l" dumb-jump-quick-look "Quick look")
      ("b" dumb-jump-back "Back"))
    )
#+end_src

** [[https://github.com/flycheck/flycheck][Flycheck]]
:PROPERTIES:
:CUSTOM_ID: flycheck
:END:

On the fly syntax checking. One of the greatest package there is for making programming easier.

*** Main mode
:PROPERTIES:
:CUSTOM_ID: main-mode
:END:

#+begin_src emacs-lisp
  (use-package flycheck
    :ensure t
    :hook ((prog-mode markdown-mode) . flycheck-mode)
    )
#+end_src

*** [[https://github.com/cpitclaudel/quick-peek][Quick Peek]]
:PROPERTIES:
:CUSTOM_ID: quick-peek
:END:

#+BEGIN_SRC elisp
  (use-package quick-peek
    :ensure t
    )
#+END_SRC

*** [[https://github.com/flycheck/flycheck-inline][Flycheck inline]]
:PROPERTIES:
:CUSTOM_ID: flycheck-inline
:END:

#+BEGIN_SRC elisp
  (use-package flycheck-inline
    :ensure t
    :after quick-peek
    :hook (flycheck-mode . flycheck-inline-mode)
    :config
    (setq flycheck-inline-display-function
          (lambda (msg pos err)
            (let* ((ov (quick-peek-overlay-ensure-at pos))
                   (contents (quick-peek-overlay-contents ov)))
              (setf (quick-peek-overlay-contents ov)
                    (concat contents (when contents "\n") msg))
              (quick-peek-update ov)))
          flycheck-inline-clear-function #'quick-peek-hide)
    )

#+END_SRC

** [[https://www.emacswiki.org/emacs/HideShow][Hideshow]]
:PROPERTIES:
:CUSTOM_ID: hideshow
:END:

#+begin_src emacs-lisp
  (use-package hideshow
    :commands (hs-minor-mode
               hs-toggle-hiding)
    :init
    (add-hook 'prog-mode-hook #'hs-minor-mode)
    :diminish hs-minor-mode
    :config
    (setq hs-isearch-open t)
    )
#+end_src

** [[https://github.com/bbatsov/projectile][Projectile]]
:PROPERTIES:
:CUSTOM_ID: projectile
:END:

Project interaction library.

#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :general
    ("M-p" 'projectile-command-map)
    :init
    (projectile-mode 1)
    )
#+end_src

** [[https://github.com/twlz0ne/separedit.el][Separedit]]
:PROPERTIES:
:CUSTOM_ID: separedit
:END:

Allows to edit comments in a separate buffer with a chosen text-mode (default is markdown-mode). When inside a comment, hit ~C-c C-e~ to start editing it in its own buffer.

#+begin_src emacs-lisp
  (use-package separedit
    :ensure t
    :general
    ("C-c C-e"                 'separedit)
    :config
    (setq separedit-default-mode 'markdown-mode)
    )
#+end_src

** [[https://github.com/Alexander-Miller/treemacs][Treemacs]]
:PROPERTIES:
:CUSTOM_ID: treemacs
:END:

#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t)
#+end_src

** Font lock

*** [[https://github.com/Fuco1/fontify-face][Fontify face]]

Allows to see immediately how a face will look

#+begin_src emacs-lisp
  (use-package fontify-face
    :ensure t
    :hook (font-lock-mode . fontify-face-mode)
    )
#+end_src

* Git
:PROPERTIES:
:CUSTOM_ID: git
:END:

** [[https://magit.vc/][Magit]]
:PROPERTIES:
:CUSTOM_ID: magit
:END:

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :config
    (setq magit-auto-revert-mode t)
    (setq magit-auto-revert-immediately t)
    :general
    ("M-v"    '(:keymap magit-mode-map :package magit :wk "Magit-:"))
    ("M-n"                 'smerge-vc-next-conflict)
    (:keymaps 'smerge-mode-map
              "M-m"                 'smerge-keep-mine
              "M-o"                 'smerge-keep-other
              )
    (:keymaps 'magit-mode-map
              "g"             'magit-status
              "G"             'git-messenger:popup-message
              "M-g"           'magit-dispatch
              )
    )
#+end_src

** [[https://github.com/alphapapa/magit-todos][Magit todos]]
:PROPERTIES:
:CUSTOM_ID: magit-todos
:END:

Adds a list of TODOS and other keywords (that can be found with ~M-h v magit-todos-keywords-list~). If you experience massive freezing when opening a magit buffer you can customize ~hl-todo-keywords-faces~ to only include your custom keywords.

#+begin_src emacs-lisp
  (when use-magit-todos
    (use-package magit-todos
      :ensure t
      :config
      (setq magit-todos-keywords-list (-mapcat (lambda (assoc) (list (car assoc))) hl-todo-keyword-faces))
      :hook
      (magit-mode . magit-todos-mode)))
#+end_src

*** [[https://github.com/tarsius/hl-todo][Highlight todo]]
:PROPERTIES:
:CUSTOM_ID: highlight-todo
:END:

Customize ~hl-todo-keyword-faces~ to choose the keywords you want to highlights (an example is already available in [[file:custom.el][custom.el]])

#+begin_src emacs-lisp
(use-package hl-todo
  :ensure t
  :config
  (global-hl-todo-mode 1))
#+end_src

** [[https://github.com/dgutov/diff-hl][Diff hl]]
:PROPERTIES:
:CUSTOM_ID: diff-hl
:END:

Nice mode to display on the fringe the uncommitted changes.

#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :custom
    (global-diff-hl-mode 1)
    :hook
    (magit-post-refresh . diff-hl-magit-post-refresh)
    (magit-pre-refresh  . diff-hl-magit-pre-refresh)
    )
#+end_src

