init.el

(use-package hydra
  :ensure t
  :custom
  (hydra-default-hint nil)
  :config
  (defhydra hydra-dates (:color teal)
    (concat "\n " (mdrp/hydra-heading "Dates" "Insert" "Insert with Time")
            "
 _q_ quit              _d_ short             _D_ short             ^^
 ^^                    _i_ iso               _I_ iso               ^^
 ^^                    _l_ long              _L_ long              ^^
")
    ("q" nil)
    ("d" mdrp/date-short)
    ("D" mdrp/date-short-with-time)
    ("i" mdrp/date-iso)
    ("I" mdrp/date-iso-with-time)
    ("l" mdrp/date-long)
    ("L" mdrp/date-long-with-time))
  )

(use-package keycast
  :ensure t
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line (fix for use with doom-mode-line)."
    :global t
    (if keycast-mode
        (add-hook 'pre-command-hook 'keycast--update t)
      (remove-hook 'pre-command-hook 'keycast--update)))
  (add-to-list 'global-mode-string '("" keycast-mode-line)))

(use-package highlight-symbol
  :ensure t
  :general
  ("M-S-<down>"   '(highlight-symbol-next :which-key "go to the next symbol"))
  ("M-S-<up>"     '(highlight-symbol-prev :which-key "go to the previous symbol"))
  :config
  (add-hook 'prog-mode-hook #'highlight-symbol-nav-mode))

(use-package multiple-cursors
  :general
  ("C-c n" 'mc/mark-next-like-this)
  ("C-c p" 'mc/mark-previous-like-this)
  ("C-c a" 'mc/mark-all-like-this)
  )

(use-package whitespace
  :ensure nil
  :hook
  (prog-mode . whitespace-mode)
  (text-mode . whitespace-mode)
  :custom
  (whitespace-style '(face empty indentation::space tab trailing)))

(use-package highlight-indent-guides
  :disabled
  :ensure t
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (setq highlight-indent-guides-auto-enabled nil)
  ;; (setq highlight-indent-guides-responsive 'stack)
  (set-face-background 'highlight-indent-guides-stack-character-face "red")
  (set-face-background 'highlight-indent-guides-top-character-face "pink")
  (set-face-foreground 'highlight-indent-guides-character-face "white")
  (setq highlight-indent-guides-method 'bitmap)
  )

(use-package apheleia
  :ensure t
  :hook
  (tuareg-mode . apheleia-mode)
  (caml-mode . apheleia-mode)
  (python-mode . apheleia-mode)
  (fsharp-mode . apheleia-mode)
  (kotlin-mode . apheleia-mode)
  :config
  (setf (alist-get 'isort apheleia-formatters)
      '("isort" "--stdout" "-"))
  (setf (alist-get 'python-mode apheleia-mode-alist)
        '(isort black)))

(use-package dap-mode
  :ensure t
  :after lsp-mode
  :config
  (dap-auto-configure-mode))

(use-package dumb-jump
  :ensure t
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (defhydra dumb-jump-hydra (:color blue :columns 3)
    "Dumb Jump"
    ("j" dumb-jump-go "Go")
    ("o" dumb-jump-go-other-window "Other window")
    ("e" dumb-jump-go-prefer-external "Go external")
    ("x" dumb-jump-go-prefer-external-other-window "Go external other window")
    ("i" dumb-jump-go-prompt "Prompt")
    ("l" dumb-jump-quick-look "Quick look")
    ("b" dumb-jump-back "Back"))
  )

(use-package flycheck
  :ensure t
  :hook ((prog-mode markdown-mode) . flycheck-mode)
  )

(use-package hideshow
  :commands (hs-minor-mode
             hs-toggle-hiding)
  :init
  (add-hook 'prog-mode-hook #'hs-minor-mode)
  :diminish hs-minor-mode
  :config
  (setq hs-isearch-open t)
  )

(use-package projectile
  :ensure t
  :general
  ("M-p" 'projectile-command-map)
  :init
  (projectile-mode 1)
  )

(use-package separedit
  :ensure t
  :general
  ("C-c C-e"                 'separedit)
  :config
  (setq separedit-default-mode 'markdown-mode)
  )

(use-package treemacs
  :ensure t)

(use-package magit
  :ensure t
  :config
  (setq magit-auto-revert-mode t)
  (setq magit-auto-revert-immediately t)
  :general
  ("M-v"    '(:keymap magit-mode-map :package magit :wk "Magit-:"))
  (:keymaps 'smerge-mode-map
            "M-n"                 'smerge-vc-next-conflict
            "M-m"                 'smerge-keep-mine
            "M-o"                 'smerge-keep-other
            )
  (:keymaps 'magit-mode-map
            "g"             'magit-status
            "G"             'git-messenger:popup-message
            "M-g"           'magit-dispatch
            )
  )

(when use-magit-todos
  (use-package magit-todos
    :ensure t
    :config
    (setq magit-todos-keywords-list (-mapcat (lambda (assoc) (list (car assoc))) hl-todo-keyword-faces))
    :hook
    (magit-mode . magit-todos-mode)))

(use-package hl-todo
  :ensure t
  :config
  (global-hl-todo-mode 1))

(use-package diff-hl
  :ensure t
  :custom
  (global-diff-hl-mode 1)
  :hook
  (magit-post-refresh . diff-hl-magit-post-refresh)
  (magit-pre-refresh  . diff-hl-magit-pre-refresh)
  )
