init.org
** [[https://magit.vc/manual/magit/Commit-Mode-and-Hooks.html][Git commit]]
:PROPERTIES:
:CUSTOM_ID: git-commit
:END:

Adds keybindings when editing a commit message.

#+begin_src emacs-lisp
(use-package git-commit
  :hook (git-commit-mode . mdrp/english-dict))
#+end_src

** [[https://github.com/emacsorphanage/git-messenger][Git messenger]]
:PROPERTIES:
:CUSTOM_ID: git-messenger
:END:

Show the commit at point to see what happened here. Invoke with ~M-v G~.

#+begin_src emacs-lisp
  (use-package git-messenger
    :ensure t
    :config
    (setq git-messenger:show-detail t
          git-messenger:use-magit-popup t))
#+end_src

** [[https://github.com/emacsmirror/git-timemachine][Git timemachine]]
:PROPERTIES:
:CUSTOM_ID: git-timemachine
:END:

Go back in time with ~M-v <left>~ then travel through commits with ~p~, ~n~ and other commands listed in the package documentation.

# TODO: Display possible commands when git-timemachine starts

#+begin_src emacs-lisp
  (use-package git-timemachine
    :ensure t
    :general
    (:keymaps 'magit-mode-map
              "<left>" '(git-timemachine :wk "Go back in git history"))
    )
#+end_src

** [[https://github.com/magit/git-modes/][Git modes]]
:PROPERTIES:
:CUSTOM_ID: git-modes
:END:

Major modes for editing .gitignore files, .git/config etc

#+begin_src emacs-lisp
  (use-package git-modes
    :ensure t)
#+end_src

** [[https://github.com/magit/ghub][Ghub]]
:PROPERTIES:
:CUSTOM_ID: ghub
:END:

#+begin_src emacs-lisp
  (use-package ghub
    :ensure t
  )
#+end_src

* Windows/Frame management
:PROPERTIES:
:CUSTOM_ID: windowsframe-management
:END:

** [[https://www.emacswiki.org/emacs/WinnerMode][Winner]]
:PROPERTIES:
:CUSTOM_ID: winner
:END:

Allows to undo and redo changes in window configurations

#+begin_src emacs-lisp
(use-package winner
  :ensure nil
  :custom
  (winner-boring-buffers
   '("*Completions*"
     "*Compile-Log*"
     "*inferior-lisp*"
     "*Fuzzy Completions*"
     "*Apropos*"
     "*Help*"
     "*cvs*"
     "*Buffer List*"
     "*Ibuffer*"
     "*esh command on file*"))
  :config
  (winner-mode 1))
#+end_src

** [[https://github.com/abo-abo/ace-window][Ace window]]
:PROPERTIES:
:CUSTOM_ID: ace-window
:END:

~C-x C-o~ for better window switching.

#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t
    :config
    (setq aw-dispatch-always t)
    (set-face-attribute 'aw-leading-char-face nil :height 2.5))
#+end_src

** [[https://codeberg.org/joostkremers/visual-fill-column][Visual fill column]]
:PROPERTIES:
:CUSTOM_ID: visual-fill-column
:END:

This mode will center the text when only one window is displayed.

#+begin_src emacs-lisp
  (when use-visual-fill
    (use-package visual-fill-column
      :ensure t
      :custom
      (visual-fill-column-width 100)
      (visual-fill-column-center-text t)
      :config

      (defun mdrp/visual-fill-one-window ()
        (global-visual-fill-column-mode -1)
        (if (window-full-width-p)
            (global-visual-fill-column-mode 1)
          (global-visual-fill-column-mode -1)
          )
        )

      (add-hook 'window-state-change-hook 'mdrp/visual-fill-one-window)
      :hook ((prog-mode org-mode text-mode) . visual-fill-column-mode)
      ))
#+end_src

* Completion
:PROPERTIES:
:CUSTOM_ID: completion
:END:

By completion two things are intended:
- text completion (be it for programs or simple text, see [[#company][Company]])
- minibuffer and command completions (emacs related, see [[#vertico][Vertico]] and friends below)

** [[https://kristofferbalintona.me/posts/202202211546/][Vertico]]
:PROPERTIES:
:CUSTOM_ID: vertico
:END:

Vertico works with the default completion system instead of reimplementing a whole system allowing better flexibility and package binding.

*** [[https://github.com/minad/vertico][Main mode]]
:PROPERTIES:
:CUSTOM_ID: main-mode
:END:

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :after general
    :init
    (vertico-mode)
    :general
    (:keymaps 'vertico-map
              "<tab>" #'vertico-insert  ; Insert selected candidate into text area
              "<escape>" #'minibuffer-keyboard-quit ; Close minibuffer
              "C-M-n" #'vertico-next-group
              "C-M-p" #'vertico-previous-group)
    (:keymaps 'minibuffer-local-map
              "M-h" #'backward-kill-word)
    :custom
    ;; Grow and shrink the Vertico minibuffer
    (vertico-resize t)
    ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
    (vertico-cycle t)
    :config
    ;; (setq vertico-sort-function 'vertico-sort-alpha)
    ;; Use `consult-completion-in-region' if Vertico is enabled.
    ;; Otherwise use the default `completion--in-region' function.
    (setq completion-in-region-function
          (lambda (&rest args)
            (apply (if vertico-mode
                       #'consult-completion-in-region
                     #'completion--in-region)
                   args)))
    ;; Prefix the current candidate with “» ”. From
    ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
    (advice-add #'vertico--format-candidate :around
                (lambda (orig cand prefix suffix index _start)
                  (setq cand (funcall orig cand prefix suffix index _start))
                  (concat
                   (if (= vertico--index index)
                       (propertize "⮕ " 'face 'vertico-current)
                     "  ")
                   cand))))

#+end_src

*** Vertico directory
:PROPERTIES:
:CUSTOM_ID: vertico-directory
:END:

Better typing of file/directory paths

Useful keybindings are:
- ~DEL~ will delete the whole subdirectory or only a character if on a filename
- ~M-DEL~ will delete the whole subdirectory or a word if on a filename

#+begin_src emacs-lisp
  (use-package vertico-directory
    :after vertico
    :ensure nil
    ;; More convenient directory navigation commands
    :general
    (:keymaps 'vertico-map
              "RET" 'vertico-directory-enter
              "<backspace>" 'vertico-directory-delete-char
              "M-<backspace>" 'vertico-directory-delete-word)
    ;; Tidy shadowed file names
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
 #+end_src

*** Vertico multiform
:PROPERTIES:
:CUSTOM_ID: vertico-multiform
:END:

This extension allows to choose the way each minibuffer will be displayed.

# TODO: Test all the possible minibuffers and customize them as I'd like them to be

#+begin_src emacs-lisp
  (use-package vertico-multiform
    :after vertico
    :ensure nil
    :custom
    (vertico-buffer-display-action '(display-buffer-in-side-window
                                     (side . right)
                                     (window-width . 0.3)))
    :config
    ;; Sort directories before files
    (defun sort-characters (characters)
      (sort characters (lambda (name1 name2) (< (char-from-name name1) (char-from-name name2)))))

    ;; Sort directories before files
    (defun sort-directories-first (files)
      (nconc (vertico-sort-alpha (seq-filter (lambda (x) (string-suffix-p "/" x)) files))
             (vertico-sort-alpha (seq-remove (lambda (x) (string-suffix-p "/" x)) files))))

    (setq vertico-multiform-commands
          '((consult-imenu buffer)
            (consult-line buffer)
            (execute-extended-command posframe mouse)
            (find-file (vertico-sort-function . sort-directories-first))
            (insert-char (vertico-sort-function . sort-characters))
            (describe-symbol (vertico-sort-override-function . vertico-sort-alpha))))

    (setq vertico-multiform-categories
          '((imenu buffer)
            (file (vertico-sort-function . sort-directories-first))
            (symbol (vertico-sort-function . vertico-sort-history-length-alpha))))

    (vertico-multiform-mode))

  (use-package vertico-posframe
    :ensure t)
#+end_src

