init.el

(use-package git-commit
  :hook (git-commit-mode . mdrp/english-dict))

(use-package git-messenger
  :ensure t
  :config
  (setq git-messenger:show-detail t
        git-messenger:use-magit-popup t))

(use-package git-timemachine
  :ensure t
  :general
  (:keymaps 'magit-mode-map
            "<left>" '(git-timemachine :wk "Go back in git history"))
  )

(use-package git-modes
  :ensure t)

(use-package ghub
  :ensure t
)

(use-package winner
  :ensure nil
  :custom
  (winner-boring-buffers
   '("*Completions*"
     "*Compile-Log*"
     "*inferior-lisp*"
     "*Fuzzy Completions*"
     "*Apropos*"
     "*Help*"
     "*cvs*"
     "*Buffer List*"
     "*Ibuffer*"
     "*esh command on file*"))
  :config
  (winner-mode 1))

(use-package ace-window
  :ensure t
  :config
  (setq aw-dispatch-always t)
  (set-face-attribute 'aw-leading-char-face nil :height 2.5))

(when use-visual-fill
  (use-package visual-fill-column
    :ensure t
    :custom
    (visual-fill-column-width 100)
    (visual-fill-column-center-text t)
    :config

    (defun mdrp/visual-fill-one-window ()
      (global-visual-fill-column-mode -1)
      (if (window-full-width-p)
          (global-visual-fill-column-mode 1)
        (global-visual-fill-column-mode -1)
        )
      )

    (add-hook 'window-state-change-hook 'mdrp/visual-fill-one-window)
    :hook ((org-mode text-mode) . visual-fill-column-mode)
    ))

(use-package vertico
  :ensure t
  :after general
  :init
  (vertico-mode)
  :general
  (:keymaps 'vertico-map
            "<tab>" #'vertico-insert  ; Insert selected candidate into text area
            "<escape>" #'minibuffer-keyboard-quit ; Close minibuffer
            "C-M-n" #'vertico-next-group
            "C-M-p" #'vertico-previous-group)
  (:keymaps 'minibuffer-local-map
            "M-h" #'backward-kill-word)
  :custom
  ;; Grow and shrink the Vertico minibuffer
  (vertico-resize t)
  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (vertico-cycle t)
  :config
  ;; Prefix the current candidate with “» ”. From
  ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
  (advice-add #'vertico--format-candidate :around
              (lambda (orig cand prefix suffix index _start)
                (setq cand (funcall orig cand prefix suffix index _start))
                (concat
                 (if (= vertico--index index)
                     (propertize "⮕ " 'face 'vertico-current)
                   "  ")
                 cand)))
  )

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :general
  (:keymaps 'vertico-map
            "RET" 'vertico-directory-enter
            "<backspace>" 'vertico-directory-delete-char
            "M-<backspace>" 'vertico-directory-delete-word)
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package vertico-multiform
  :after vertico
  :ensure nil
  :custom
  (vertico-buffer-display-action '(display-buffer-in-side-window
                                   (side . right)
                                   (window-width . 0.3)))
  :config
  (setq vertico-multiform-commands
        '((consult-imenu buffer)
          (consult-line buffer)
          (execute-extended-command posframe mouse)))

  (setq vertico-multiform-categories
        '((imenu buffer)
          (symbol (vertico-sort-function . vertico-sort-alpha))
          (t posframe)
          ))
  (vertico-multiform-mode))

(use-package vertico-posframe
  :ensure t)

(use-package consult
  :ensure t
