init.org
** [[https://github.com/minad/corfu][Corfu]]

#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    ;; (corfu-auto t)                 ;; Enable auto completion
    ;; (corfu-separator ?\s)          ;; Orderless field separator
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect-first nil)    ;; Disable candidate preselection
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    ;; (corfu-echo-documentation nil) ;; Disable documentation in the echo area
    ;; (corfu-scroll-margin 5)        ;; Use scroll margin

    ;; Enable Corfu only for certain modes.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.
    ;; This is recommended since Dabbrev can be used globally (M-/).
    ;; See also `corfu-excluded-modes'.
    :init
    (global-corfu-mode))
#+end_src

** Emacs configuration for minibuffers and completion
:PROPERTIES:
:CUSTOM_ID: emacs-configuration-for-minibuffers-and-completion
:END:

#+begin_src emacs-lisp
  (use-package emacs
    :ensure t
    :init
    ;; TAB cycle if there are only few candidates
    (setq completion-cycle-threshold 3)
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

    ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
    ;; Vertico commands are hidden in normal buffers.
    (setq read-extended-command-predicate
          #'command-completion-default-include-p)

    ;; Enable recursive minibuffers
    (setq enable-recursive-minibuffers t))
#+end_src

** [[https://github.com/oantolin/orderless][Orderless]]
:PROPERTIES:
:CUSTOM_ID: orderless
:END:

Better completions in minibuffers

#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

** [[https://github.com/minad/cape][Cape]]

#+begin_src emacs-lisp
  (use-package cape
    :ensure t
    ;; Bind dedicated completion commands
    ;; Alternative prefix keys: C-c p, M-p, M-+, ...
    ;; :bind (("C-c p p" . completion-at-point) ;; capf
    ;;        ("C-c p t" . complete-tag)        ;; etags
    ;;        ("C-c p d" . cape-dabbrev)        ;; or dabbrev-completion
    ;;        ("C-c p h" . cape-history)
    ;;        ("C-c p f" . cape-file)
    ;;        ("C-c p k" . cape-keyword)
    ;;        ("C-c p s" . cape-symbol)
    ;;        ("C-c p a" . cape-abbrev)
    ;;        ("C-c p i" . cape-ispell)
    ;;        ("C-c p l" . cape-line)
    ;;        ("C-c p w" . cape-dict)
    ;;        ("C-c p \\" . cape-tex)
    ;;        ("C-c p _" . cape-tex)
    ;;        ("C-c p ^" . cape-tex)
    ;;        ("C-c p &" . cape-sgml)
    ;;        ("C-c p r" . cape-rfc1345))
    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.
    (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    (add-to-list 'completion-at-point-functions #'cape-file)
    ;;(add-to-list 'completion-at-point-functions #'cape-history)
    ;;(add-to-list 'completion-at-point-functions #'cape-keyword)
    ;;(add-to-list 'completion-at-point-functions #'cape-tex)
    ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
    ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
    ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
    ;;(add-to-list 'completion-at-point-functions #'cape-ispell)
    ;;(add-to-list 'completion-at-point-functions #'cape-dict)
    ;;(add-to-list 'completion-at-point-functions #'cape-symbol)
    ;;(add-to-list 'completion-at-point-functions #'cape-line)
  )
#+end_src

** [[https://github.com/emacs-straight/marginalia][Marginalia]]
:PROPERTIES:
:CUSTOM_ID: marginalia
:END:

Useful informations added in the minibuffer options

#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :ensure t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

** Iedit

#+BEGIN_SRC elisp
  (use-package iedit
    :ensure t
    :general
    (:keymaps 'lsp-mode-map
              "C-;" nil))
#+END_SRC

** [[https://github.com/joaotavora/yasnippet][Yasnippet]]
:PROPERTIES:
:CUSTOM_ID: yasnippet
:END:

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1)
    )

#+end_src
** [[https://github.com/company-mode/company-mode][Company]]
:PROPERTIES:
:CUSTOM_ID: company
:END:

Text completion framework.

#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :hook ((prog-mode . company-mode)
           (org-mode . company-mode))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0)
    :general
    (:keymaps 'company-active-map
              "<tab>" 'company-complete-selection)
    :config
    (defun mdrp/disable-automatic-company ()
      (interactive)
      (setq company-idle-delay nil)
      )
    (defun mdrp/enable-automatic-company (i)
      (interactive "nIdle-delay: ")
      (setq-local company-idle-delay i)
      )
    (defun add-pcomplete-to-capf ()
      (add-hook 'completion-at-point-functions 'pcomplete-completions-at-point nil t))
    (add-hook 'org-mode-hook #'add-pcomplete-to-capf)
    (setq company-minimum-prefix-length 1
          company-show-numbers ''left
          company-tooltip-align-annotations t
          company-require-match 'never
          company-tooltip-align-annotations t
          )
    (add-to-list 'company-backends 'company-capf)
    (add-to-list 'company-backends 'company-yasnippet)
    (global-company-mode 1)
    )
#+end_src

#+begin_src elisp
  (use-package company-quickhelp
    :ensure t
    :after company
    :hook (company-mode . company-quickhelp-mode)
    :config
    (setq company-quickhelp-delay 0)
    (company-quickhelp-mode 1)
    )
#+end_src

*** [[https://github.com/vspinu/company-math][Company math]]
:PROPERTIES:
:CUSTOM_ID: company-math
:END:

Company for LaTeX math mode.

# #+begin_src emacs-lisp
#   (use-package company-math
#     :ensure t
#     ;; :preface
#     ;; (autoload 'company-math-symbols-latex "company-math")
#     ;; (autoload 'company-latex-commands "company-math")
#     :hook
#     (TeX-mode . (lambda ()
#                   (setq-local company-backends '((company-math-symbols-latex
#                                                   company-latex-commands
#                                                   company-capf)))))
#     (TeX-mode . my/latex-mode-setup)
#     :config
#     (defun my/latex-mode-setup ()
#       (setq-local company-backends
#                   (append '((company-math-symbols-latex company-latex-commands))
#                           company-backends)))
#     )
# #+end_src

*** [[https://github.com/osv/company-web][Company web]]
:PROPERTIES:
:CUSTOM_ID: company-web
:END:

#+begin_src emacs-lisp
  (use-package company-web
    :ensure t
    :preface
    (autoload 'company-web-html "company-web-html")
    (autoload 'company-web-jade "company-web-jade")
    (autoload 'company-web-slim "company-web-slim")
    :hook ((web-mode . (lambda ()
                         (setq-local company-backends '(company-web-html
                                                        company-web-jade
                                                        company-web-slim
                                                        company-capf))))))
#+end_src

