init.org
*** [[https://github.com/seagle0128/doom-modeline][Doom modeline]]
:PROPERTIES:
:CUSTOM_ID: doom-modeline
:END:

This mode allows to customize entirely the emacs mode-line. Two mode-lines are defined here, one when lsp-mode is active and one when it isn't since lsp-mode already displays informations that would be redundant with the default mode-line.

Read the comments in the code if you want to understand its configuration.

Some customization is available from [[file:custom.el][custom.el]], mainly ~doom-modeline-bar-width~ and ~doom-modeline-height~.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init
    ;; If non-nil, cause imenu to see `doom-modeline' declarations.
    ;; This is done by adjusting `lisp-imenu-generic-expression' to
    ;; include support for finding `doom-modeline-def-*' forms.
    ;; Must be set before loading doom-modeline.
    (setq doom-modeline-support-imenu t)
    :custom

    ;; Whether to use hud instead of default bar. It's only respected in GUI.
    (doom-modeline-hud nil)

    ;; The limit of the window width.
    ;; If `window-width' is smaller than the limit, some information won't be
    ;; displayed. It can be an integer or a float number. `nil' means no limit."
    (doom-modeline-window-width-limit 85)

    ;; How to detect the project root.
    ;; nil means to use `default-directory'.
    ;; The project management packages have some issues on detecting project root.
    ;; e.g. `projectile' doesn't handle symlink folders well, while `project' is unable
    ;; to hanle sub-projects.
    ;; You can specify one if you encounter the issue.
    (doom-modeline-project-detection 'projectile)

    ;; Determines the style used by `doom-modeline-buffer-file-name'.
    ;;
    ;; Given ~/Projects/FOSS/emacs/lisp/comint.el
    ;;   auto => emacs/l/comint.el (in a project) or comint.el
    ;;   truncate-upto-project => ~/P/F/emacs/lisp/comint.el
    ;;   truncate-from-project => ~/Projects/FOSS/emacs/l/comint.el
    ;;   truncate-with-project => emacs/l/comint.el
    ;;   truncate-except-project => ~/P/F/emacs/l/comint.el
    ;;   truncate-upto-root => ~/P/F/e/lisp/comint.el
    ;;   truncate-all => ~/P/F/e/l/comint.el
    ;;   truncate-nil => ~/Projects/FOSS/emacs/lisp/comint.el
    ;;   relative-from-project => emacs/lisp/comint.el
    ;;   relative-to-project => lisp/comint.el
    ;;   file-name => comint.el
    ;;   buffer-name => comint.el<2> (uniquify buffer name)
    ;;
    ;; If you are experiencing the laggy issue, especially while editing remote files
    ;; with tramp, please try `file-name' style.
    ;; Please refer to https://github.com/bbatsov/projectile/issues/657.
    (doom-modeline-buffer-file-name-style 'truncate-all)

    ;; Whether display icons in the mode-line.
    ;; While using the server mode in GUI, should set the value explicitly.
    (doom-modeline-icon t)

    ;; Whether display the colorful icon for `major-mode'.
    ;; It respects `all-the-icons-color-icons'.
    (doom-modeline-major-mode-color-icon t)

    ;; Whether display the icon for the buffer state. It respects `doom-modeline-icon'.
    (doom-modeline-buffer-state-icon t)

    ;; Whether display the modification icon for the buffer.
    ;; It respects `doom-modeline-icon' and `doom-modeline-buffer-state-icon'.
    (doom-modeline-buffer-modification-icon t)

    ;; Whether to use unicode as a fallback (instead of ASCII) when not using icons.
    (doom-modeline-unicode-fallback t)

    ;; Major modes in which to display word count continuously.
    ;; Also applies to any derived modes. Respects `doom-modeline-enable-word-count'.
    ;; If it brings the sluggish issue, disable `doom-modeline-enable-word-count' or
    ;; remove the modes from `doom-modeline-continuous-word-count-modes'.
    (doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode))

    ;; If non-nil, only display one number for checker information if applicable.
    (doom-modeline-checker-simple-format nil)

    ;; The maximum number displayed for notifications.
    (doom-modeline-number-limit 99)

    ;; The maximum displayed length of the branch name of version control.
    (doom-modeline-vcs-max-length 12)

    ;; Whether display the GitHub notifications. It requires `ghub' package.
    (doom-modeline-github t)

    ;; The interval of checking GitHub.
    (doom-modeline-github-interval 30)

    ;; Whether display the environment version.
    (doom-modeline-env-version t)
    ;; Or for individual languages
    (doom-modeline-env-enable-python t)
    (doom-modeline-env-enable-ruby t)
    (doom-modeline-env-enable-perl t)
    (doom-modeline-env-enable-go t)
    (doom-modeline-env-enable-elixir t)
    (doom-modeline-env-enable-rust t)

    ;; Change the executables to use for the language version string
    (doom-modeline-env-python-executable "python") ; or `python-shell-interpreter'
    (doom-modeline-env-ruby-executable "ruby")
    (doom-modeline-env-perl-executable "perl")
    (doom-modeline-env-go-executable "go")
    (doom-modeline-env-elixir-executable "iex")
    (doom-modeline-env-rust-executable "rustc")

    ;; What to display as the version while a new one is being loaded
    (doom-modeline-env-load-string "...")


    :config
    ;; TEMP: Emacs 29 adds position to symbols.
    (setq doom-modeline-fn-alist
          (if (functionp 'remove-pos-from-symbol)
              (--map
               (cons (remove-pos-from-symbol (car it)) (cdr it))
               doom-modeline-fn-alist)
            doom-modeline-fn-alist))

    ;; Define your custom doom-modeline
    (doom-modeline-def-modeline 'mdrp/no-lsp-line
                                '(bar " " matches follow buffer-info modals remote-host buffer-position word-count parrot selection-info)
                                '(misc-info persp-name battery grip github debug minor-modes input-method indent-info buffer-encoding major-mode process vcs checker))

    (doom-modeline-def-modeline 'mdrp/lsp-line
                                '(bar " " matches follow lsp modals remote-host buffer-position word-count parrot selection-info)
                                '(misc-info persp-name battery grip github debug minor-modes input-method indent-info buffer-encoding major-mode process vcs checker))

    ;; Add to `doom-modeline-mode-hook` or other hooks
    (defun mdrp/setup-no-lsp-doom-modeline ()
      (message "doom no lsp modeline change")
      (doom-modeline-set-modeline 'mdrp/no-lsp-line 'default))

    (defun mdrp/setup-lsp-doom-modeline ()
      (message "doom lsp modeline change")
      (doom-modeline-set-modeline 'mdrp/lsp-line nil))

    (add-hook 'doom-modeline-mode-hook 'mdrp/setup-no-lsp-doom-modeline)
    (add-hook 'lsp-mode-hook 'mdrp/setup-lsp-doom-modeline)
    (message "doom modeline loaded")
    (doom-modeline-mode))
#+end_src

*** [[https://github.com/tarsius/minions][Minions]]
:PROPERTIES:
:CUSTOM_ID: minions
:END:

Implements a menu that lists enabled and disabled minor modes in the mode-line.

#+begin_src emacs-lisp
  (use-package minions
    :ensure t
    :after (doom-modeline)
    :config (minions-mode)
    :custom
    (minions-mode-line-lighter "☰")
    )
#+end_src

** [[https://www.emacswiki.org/emacs/OutlineMinorMode][Outline]] (major and minor modes)
:PROPERTIES:
:CUSTOM_ID: outline-major-and-minor-modes
:END:

