init.el
  (define-prefix-command 'cm-map nil "Outline-")
  (set-display-table-slot standard-display-table
                          'selective-display
                          (string-to-vector "+++"))
  :general
  ("C-o" 'cm-map)
  (:keymaps 'cm-map
            ;; HIDE
            "q" '(outline-hide-sublevels :which-key "Hide everything but the top-level headings")
            "t" '(outline-hide-body :which-key "Hide everything but headings (all body lines")
            "o" '(outline-hide-other :which-key "Hide other branche")
            "c" '(outline-hide-entry :which-key "Hide this entry's bod")
            "l" '(outline-hide-leaves :which-key "Hide body lines in this entry and sub-entrie")
            "d" '(outline-hide-subtree :which-key "Hide everything in this entry and sub-entrie")
            ;; SHOW
            "a" '(outline-show-all :which-key "Show (expand) everythin")
            "e" '(outline-show-entry :which-key "Show this heading's bod")
            "i" '(outline-show-children :which-key "Show this heading's immediate child sub-heading")
            "k" '(outline-show-branches :which-key "Show all sub-headings under this headin")
            "s" '(outline-show-subtree :which-key "Show (expand) everything in this heading & belo")
            ;; MOVE
            "u" '(outline-up-heading :which-key "U")
            "n" '(outline-next-visible-heading :which-key "Nex")
            "p" '(outline-previous-visible-heading :which-key "Previou")
            "f" '(outline-forward-same-level :which-key "Forward - same leve")
            "b" '(outline-backward-same-level :which-key "Backward - same leve")
            )
  )

(use-package outline-minor
  :ensure nil
  :hook (prog-mode . outline-minor-mode)
)

(use-package outshine
  :ensure t
  :init (defvar outline-minor-mode-prefix "\C-o")
  :hook (outline-minor-mode . outshine-mode)
  :config
  (setq outshine-preserve-delimiter-whitespace nil)
  )

(use-package pretty-outlines
  :defer t
  :load-path "lisp/"
  :hook (
         (outline-mode . pretty-outlines-set-display-table)
         (outline-minor-mode . pretty-outlines-set-display-table)
         (emacs-lisp-mode . pretty-outlines-add-bullets)
         )
  )

(use-package rainbow-mode
  :ensure t
  :hook (help-mode prog-mode text-mode)
  )

(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package pulsar
  :ensure t
  :config
  (setq pulsar-pulse-functions
        '(recenter-top-bottom
          move-to-window-line-top-bottom
          reposition-window
          forward-page
          backward-page
          scroll-up-command
          scroll-down-command
          org-next-visible-heading
          org-previous-visible-heading
          org-forward-heading-same-level
          org-backward-heading-same-level
          outline-backward-same-level
          outline-forward-same-level
          outline-next-visible-heading
          outline-previous-visible-heading
          outline-up-heading
          up-slightly
          down-slightly
          ))

  (setq pulsar-pulse-on-window-change t)
  (setq pulsar-pulse t)
  (setq pulsar-delay 0.055)
  (setq pulsar-iterations 10)
  (setq pulsar-face 'pulsar-magenta)
  (setq pulsar-highlight-face 'pulsar-yellow)
  (pulsar-global-mode 1)
  :defer t
  )
