init.org
* [[https://orgmode.org/][Org mode]]
:PROPERTIES:
:CUSTOM_ID: org-mode
:END:

Org mode is, well, org mode.

#+begin_src emacs-lisp
  (require 'org-protocol)

  (use-package org
    :ensure t
    ;; :hook (org-mode . variable-pitch-mode)
    :init
    (setq org-list-allow-alphabetical t)
    ;; If you don't want the agenda in french you can comment the following
    ;; expression. You can even set it to your preferred language
    ;; https://www.emacswiki.org/emacs/CalendarLocalization#toc16
    (setq calendar-week-start-day 1
          calendar-day-name-array ["Dimanche" "Lundi" "Mardi" "Mercredi"
                                   "Jeudi" "Vendredi" "Samedi"]
          calendar-month-name-array ["Janvier" "Février" "Mars" "Avril" "Mai"
                                     "Juin" "Juillet" "Août" "Septembre"
                                     "Octobre" "Novembre" "Décembre"])

    (defun mdrp/org-compile-latex-and-update-other-buffer ()
      "Has as a premise that it's run from an org-mode buffer and the
       other buffer already has the PDF open"
      (interactive)
      (org-latex-export-to-pdf)
      (mdrp/update-other-buffer)
      )

    :custom
    (org-directory "~/org/")
    ;; Babel
    (org-confirm-babel-evaluate nil)
    (org-src-fontify-natively t)
    (org-src-tab-acts-natively t)
    ;; Rest
    (org-agenda-files `(,org-directory))
    (org-ellipsis " ▾")
    (org-footnote-auto-adjust t)
    (org-cycle-separator-lines -1)
    (org-startup-truncated nil)
    (org-adapt-indentation nil)
    (org-hide-emphasis-markers t)
    (org-fontify-done-headline t)
    (org-hide-leading-stars t)
    (org-pretty-entities t)
    (org-support-shift-select 'always)
    (org-agenda-start-with-log-mode t)
    (org-agenda-start-day "1d")
    (org-agenda-span 'week)
    (org-agenda-start-on-weekday nil)
    (org-log-done 'time)
    (org-src-fontify-natively t)
    (org-src-tab-acts-natively t)
    (org-tag-persistent-alist
     '((:startgroup . nil)
       ("Maison" . ?h)
       ("Boulot" . ?b)
       ("Plaisir" . ?p)
       (:endgroup . nil)
       (:startgroup . nil)
       ("Irmin" . ?i)
       ("Ocaml" . ?o)
       ("Reste" . ?r)
       (:endgroup . nil)
       (:startgroup . nil)
       ("Facile" . ?f)
       ("Moyen" . ?m)
       ("Difficile" . ?d)
       (:endgroup . nil)
       )
     )
    (org-tag-faces
     '(
       ("Maison" . (:foreground "GoldenRod" :weight bold))
       ("Boulot" . (:foreground "GoldenRod" :weight bold))
       ("Irmin" . (:foreground "IndianRed1" :weight bold))
       ("OCaml" . (:foreground "IndianRed1" :weight bold))
       ("Reste" . (:foreground "IndianRed1" :weight bold))
       ("Facile" . (:foreground "OrangeRed" :weight bold))
       ("Moyen" . (:foreground "OrangeRed" :weight bold))
       ("Difficile" . (:foreground "OrangeRed" :weight bold))
       )
     )
    :bind-keymap ("M-o" . mdrp-org-map)
    :bind (
           ("C-x C-p" . mdrp/org-compile-latex-and-update-other-buffer)
           (:map mdrp-org-map
                 ("l"                       . org-store-link)
                 ("a"                       . org-agenda)
                 ("c"                       . org-capture)
                 )
           (:map org-mode-map
                 ("M-j"                     . org-goto)
                 )
           )

    :config
    ;; TODO states
    (setq org-todo-keywords
          '((sequence "TODO(t)" "PLANNING(p)" "IN-PROGRESS(i@/!)" "VERIFYING(v!)" "BLOCKED(b@)"  "|" "DONE(d!)" "OBE(o@!)" "WONT-DO(w@/!)" )
            ))
    (define-prefix-command 'mdrp-org-map nil "Org-")
    (defun transform-square-brackets-to-round-ones(string-to-transform)
      "Transforms [ into ( and ] into ), other chars left unchanged."
      (concat
       (mapcar #'(lambda (c) (if (equal c ?\[) ?\( (if (equal c ?\]) ?\) c))) string-to-transform))
      )

    (setq org-capture-templates
          `(
            ("p" "Protocol" entry (file+headline ,(concat org-directory "notes.org") "Inbox")
             "* %^{Title}\nSource: %u, %c\n #+BEGIN_QUOTE\n%i\n#+END_QUOTE\n\n\n%?")
            ("L" "Protocol Link" entry (file+headline ,(concat org-directory "notes.org") "Inbox")
             "* %? [[%:link][%(transform-square-brackets-to-round-ones \"%:description\")]]\n")
            ))
    (customize-set-value 'org-latex-with-hyperref nil)
    (add-to-list 'org-latex-default-packages-alist "\\PassOptionsToPackage{hyphens}{url}")
    (setq org-image-actual-width nil)
    (defun org-mode-<>-syntax-fix (start end)
      "Change syntax of characters ?< and ?> to symbol within source code blocks."
      (let ((case-fold-search t))
        (when (eq major-mode 'org-mode)
          (save-excursion
            (goto-char start)
            (while (re-search-forward "<\\|>" end t)
              (when (save-excursion
                      (and
                       (re-search-backward "[[:space:]]*#\\+\\(begin\\|end\\)_src\\_>" nil t)
                       (string-equal (downcase (match-string 1)) "begin")))
                ;; This is a < or > in an org-src block
                (put-text-property (point) (1- (point))
                                   'syntax-table (string-to-syntax "_"))))))))

    (defun org-setup-<>-syntax-fix ()
      "Setup for characters ?< and ?> in source code blocks.
    Add this function to `org-mode-hook'."
      (setq syntax-propertize-function 'org-mode-<>-syntax-fix)
      (syntax-propertize (point-max)))

    (add-hook 'org-mod-hook #'org-setup-<>-syntax-fix)

    (setq org-agenda-custom-commands
          '(("r" "Rendez-vous" agenda* "Rendez-vous du mois"
             ((org-agenda-span 'month)
              (org-agenda-show-all-dates nil)
              ))))
    (calendar-set-date-style 'iso)
    (use-package ob-rust :ensure t)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (emacs-lisp . t)
       (rust . t)
       (ocaml . t)
       (latex . t)
       (shell . t)
       ))
    (add-hook 'org-mode-hook
              (lambda ()
                (push '("- [ ]" . "") prettify-symbols-alist)
                (push '("+ [ ]" . "") prettify-symbols-alist)
                (push '("* [ ]" . "") prettify-symbols-alist)
                (push '("- [X]" . "") prettify-symbols-alist)
                (push '("+ [X]" . "") prettify-symbols-alist)
                (push '("* [X]" . "") prettify-symbols-alist)
                (push '("- [-]" . "") prettify-symbols-alist)
                (push '("+ [-]" . "") prettify-symbols-alist)
                (push '("* [-]" . "") prettify-symbols-alist)
                (prettify-symbols-mode)
                ))
    (custom-theme-set-faces
     'user
     '(org-block ((t (:inherit fixed-pitch))))
     '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
     '(org-document-title ((t (:inherit variable-pitch :height 1.4 :weight bold :foreground "#c678dd"))))
     '(org-level-1 ((t (:inherit variable-pitch :height 1.7 :weight bold :foreground "#51afef"))))
     '(org-level-2 ((t (:inherit variable-pitch :height 1.4 :weight bold :foreground "#c678dd"))))
     '(org-level-3 ((t (:inherit variable-pitch :height 1.2 :weight bold :foreground "#a9a1e1"))))
     '(org-level-4 ((t (:inherit variable-pitch :height 1.1 :weight bold :foreground "#7cc3f3"))))
     '(org-level-5 ((t (:inherit variable-pitch :height 1.0 :weight bold))))
     '(org-level-6 ((t (:inherit variable-pitch :height 1.0 :weight bold))))
     '(org-level-7 ((t (:inherit variable-pitch :height 1.0 :weight bold))))
     '(org-level-8 ((t (:inherit variable-pitch :height 1.0 :weight bold))))
     '(org-property-value ((t (:inherit fixed-pitch))) t)
     '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
     '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold))))
     '(org-verbatim ((t (:inherit (shadow fixed-pitch)))))
     ;; (let ((re "\\}\\(+\\|-\\) "))
     ;;   (font-lock-add-keywords
     ;;     'org-mode
     ;;     `((,(concat "^[[:space:]]\\{" (number-to-string (+ 0 org-list-indent-offset)) re)
     ;;        (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

     ;;    (font-lock-add-keywords
     ;;     'org-mode
     ;;     `((,(concat "^[[:space:]]\\{" (number-to-string (+ 2 org-list-indent-offset)) re)
     ;;        (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◆"))))))

     ;;    (font-lock-add-keywords
     ;;     'org-mode
     ;;     `((,(concat "^[[:space:]]\\{" (number-to-string
     ;;                                    (* 2 (+ 2 org-list-indent-offset))) re)
     ;;        (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◇"))))))
     ;;    (font-lock-add-keywords
     ;;     'org-mode
     ;;     `((,(concat "^[[:space:]]\\{" (number-to-string
     ;;                                    (* 3 (+ 2 org-list-indent-offset))) re)
     ;;        (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◼"))))))
     ;;    )
     )
    )
#+end_src

