init.org
** [[https://github.com/jkitchin/org-ref][Org ref]]
:PROPERTIES:
:CUSTOM_ID: org-ref
:END:
:PROPERTIES:

Not using it anymore since I don't write articles but it may be useful

:CUSTOM_ID: org-ref
:END:
#+begin_src emacs-lisp
  (use-package org-ref
    :ensure t
    :after org
    :init
    (setq
     org-ref-completion-library 'org-ref-ivy-cite
     )
    :custom
    (org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
    )
#+end_src

** [[https://github.com/sabof/org-bullets][Org bullets]]
:PROPERTIES:
:CUSTOM_ID: org-bullets
:END:

#+begin_src emacs-lisp
  (use-package org-bullets
    :ensure t
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("" "" "" "" "" "" ""))
    )
#+end_src

** [[https://github.com/shg/org-inline-pdf.el][Org inline pdf]]
:PROPERTIES:
:CUSTOM_ID: org-inline-pdf
:END:

See pdf inlined when included in org files.

#+begin_src emacs-lisp
  (use-package org-inline-pdf
    :ensure t
    :hook (org-mode . org-inline-pdf-mode)
    )
#+end_src

** [[https://github.com/kiwanami/emacs-calfw][Calfw]]
:PROPERTIES:
:CUSTOM_ID: calfw
:END:

Calendar view in emacs buffer.

#+begin_src emacs-lisp
  (use-package calfw
    :ensure t
    :config
    (setq cfw:org-overwrite-default-keybinding t)
    (setq cfw:fchar-junction ?╋
          cfw:fchar-vertical-line ?┃
          cfw:fchar-horizontal-line ?━
          cfw:fchar-left-junction ?┣
          cfw:fchar-right-junction ?┫
          cfw:fchar-top-junction ?┯
          cfw:fchar-top-left-corner ?┏
          cfw:fchar-top-right-corner ?┓)
    )
#+end_src

** [[https://github.com/kiwanami/emacs-calfw][Calfw org]]
:PROPERTIES:
:CUSTOM_ID: calfw-org
:END:

This package allows to see the org calendar and adds a capture template for scheduling.

#+begin_src emacs-lisp
  (use-package calfw-org
    :ensure t
    :after calfw
    :init
    (define-prefix-command 'mdrp-calfw-map nil "Cal-")
    :config
    (defun cfw:org-capture-day ()
      (with-current-buffer  (get-buffer-create cfw:calendar-buffer-name)
        (let ((pos (cfw:cursor-to-nearest-date)))
          (concat "<"
                  (format-time-string  "%Y-%m-%d %a 09:00"
                                       (encode-time 0 0 0
                                                    (calendar-extract-day pos)
                                                    (calendar-extract-month pos)
                                                    (calendar-extract-year pos)))
                  ">"))))
    :general
    ("M-c" 'mdrp-calfw-map)
    (:keymaps 'mdrp-calfw-map
              "c" 'cfw:open-calendar-buffer
              "o" 'cfw:open-org-calendar
              )
    (:keymaps 'cfw:calendar-mode-map
              "RET" 'cfw:org-open-agenda-day)
    :custom
    (cfw:org-capture-template
     `("c" "calfw2org" entry (file+headline ,(concat org-directory "agenda.org") "Calendrier")
       "* %?\nSCHEDULED: %(cfw:org-capture-day)" :empty-lines 1)
     )
    )

#+end_src

** DISABLED: [[https://github.com/myuhe/org-gcal.el][Org gcal]]
:PROPERTIES:
:CUSTOM_ID: disabled-org-gcal
:END:

If I have to reuse a Google calendar I may enable this package again but I don't need it right now.

#+begin_src emacs-lisp
  ;; The request can be wrong depending on Google updates, evaluate this:
  ;; (concat org-gcal-auth-url
  ;;         "?client_id=" (url-hexify-string org-gcal-client-id)
  ;;         "&response_type=code"
  ;;         "&redirect_uri=" (url-hexify-string "urn:ietf:wg:oauth:2.0:oob")
  ;;         "&scope=" (url-hexify-string org-gcal-resource-url))

  (use-package org-gcal
    :disabled
    :custom
    (org-gcal-client-id (get-secrets-config-value 'org-gcal-client-id))
    (org-gcal-client-secret (get-secrets-config-value 'org-gcal-client-secret))
    (org-gcal-fetch-file-alist
     `(
       (,(get-secrets-config-value 'calendar-company) . "~/org/calendar_company.org")
       (,(get-secrets-config-value 'calendar-user) . "~/org/calendar_user.org")
       )
     )
    )
#+end_src

** [[https://github.com/alphapapa/org-super-agenda][Org super agenda]]
:PROPERTIES:
:CUSTOM_ID: org-super-agenda
:END:

Better agenda view for ~org-agenda~

#+begin_src emacs-lisp
  (use-package org-super-agenda
    :ensure t
    :config
    (setq org-super-agenda-groups
          '(;; Each group has an implicit Boolean OR operator between its selectors.
            (:name "Rendez-vous"  ; Optionally specify section name
                   :time-grid t  ; Items that appear on the time grid
                   )
            ;; After the last group, the agenda will display items that didn't
            ;; match any of these groups, with the default order position of 99
            ))
    (org-super-agenda-mode)
    (when org-agenda-start (org-agenda nil "a"))
    )
#+end_src

** [[https://github.com/awth13/org-appear][Org appear]]
:PROPERTIES:
:CUSTOM_ID: org-appear
:END:

Like unprettify at point but for org invisible elements (links etc)

#+begin_src emacs-lisp
  (use-package org-appear
    :ensure t
    :hook (org-mode . org-appear-mode)
    :config
    (setq org-appear-autolinks t)
    )
#+end_src

** [[https://github.com/org-roam/org-roam][Org roam]]
:PROPERTIES:
:CUSTOM_ID: org-roam
:END:

The next package I need to use fully, just starting right now.

#+begin_src emacs-lisp
  (when use-org-roam
    (use-package org-roam
      :ensure t
      :after org
      :custom
      (org-roam-directory (file-truename "~/org/org-roam"))
      :general
      (:keymaps 'mdrp-org-map
                "r" 'org-roam-buffer-toggle
                "f" 'org-roam-node-find
                "g" 'org-roam-graph
                "i" 'org-roam-node-insert
                "c" 'org-roam-capture
                ;; Dailies
                "j" 'org-roam-dailies-capture-today)
      :config
      ;; If you're using a vertical completion framework, you might want a more informative completion interface
      (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
      (org-roam-db-autosync-mode)
      ;; If using org-roam-protocol
      (require 'org-roam-protocol)))
#+end_src

** [[https://github.com/alphapapa/org-make-toc][Org make toc]]
:PROPERTIES:
:CUSTOM_ID: org-make-toc
:END:

Helper to create table of contents in org files.

#+begin_src emacs-lisp
  (use-package org-make-toc
    :ensure t
    :custom
    (org-make-toc-insert-custom-ids t))
#+end_src

* [[https://github.com/emacs-lsp/lsp-mode/][LSP]]
:PROPERTIES:
:CUSTOM_ID: lsp
:END:

Minor mode acting as a client between a language server protocol and emacs.

