init.el

(use-package org-ref
  :ensure t
  :after org
  :init
  (setq
   org-ref-completion-library 'org-ref-ivy-cite
   )
  :custom
  (org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
  )

(use-package org-tempo ;; part of org-mode
  :ensure nil
  :after org
  :config
  (add-to-list 'org-structure-template-alist '("smt" . "src smt-lib"))
  (add-to-list 'org-structure-template-alist '("oc" . "src ocaml"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  )

(use-package org-bullets
  :ensure t
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("" "" "" "" "" "" ""))
  )

(use-package org-inline-pdf
  :ensure t
  :hook (org-mode . org-inline-pdf-mode)
  )

(use-package calfw
  :ensure t
  :config
  (setq cfw:fchar-junction ?╋
        cfw:fchar-vertical-line ?┃
        cfw:fchar-horizontal-line ?━
        cfw:fchar-left-junction ?┣
        cfw:fchar-right-junction ?┫
        cfw:fchar-top-junction ?┯
        cfw:fchar-top-left-corner ?┏
        cfw:fchar-top-right-corner ?┓)
  )

(use-package calfw-org
  :ensure t
  :after calfw
  :config
  (define-prefix-command 'mdrp-calfw-map nil "Cal-")
  (defun cfw:org-capture-day ()
    (with-current-buffer  (get-buffer-create cfw:calendar-buffer-name)
      (let ((pos (cfw:cursor-to-nearest-date)))
        (concat "<"
                (format-time-string  "%Y-%m-%d %a 09:00"
                                     (encode-time 0 0 0
                                                  (calendar-extract-day pos)
                                                  (calendar-extract-month pos)
                                                  (calendar-extract-year pos)))
                ">"))))
  :general
  ("M-c" 'mdrp-calfw-map)
  (:keymaps 'mdrp-calfw-map
            "c" 'cfw:open-calendar-buffer
            "o" 'cfw:open-org-calendar
            )
  :custom
  (cfw:org-capture-template
   `("c" "calfw2org" entry (file+headline ,(concat org-directory "agenda.org") "Calendrier")
     "* %?\nSCHEDULED: %(cfw:org-capture-day)" :empty-lines 1)
   )
  )

;; The request can be wrong depending on Google updates, evaluate this:
;; (concat org-gcal-auth-url
;;         "?client_id=" (url-hexify-string org-gcal-client-id)
;;         "&response_type=code"
;;         "&redirect_uri=" (url-hexify-string "urn:ietf:wg:oauth:2.0:oob")
;;         "&scope=" (url-hexify-string org-gcal-resource-url))

(use-package org-gcal
  :disabled
  :custom
  (org-gcal-client-id (get-secrets-config-value 'org-gcal-client-id))
  (org-gcal-client-secret (get-secrets-config-value 'org-gcal-client-secret))
  (org-gcal-fetch-file-alist
   `(
     (,(get-secrets-config-value 'calendar-company) . "~/org/calendar_company.org")
     (,(get-secrets-config-value 'calendar-user) . "~/org/calendar_user.org")
     )
   )
  )

(use-package org-super-agenda
  :ensure t
  :config
  (setq org-super-agenda-groups
        '(;; Each group has an implicit Boolean OR operator between its selectors.
          (:name "ASDSD"  ; Optionally specify section name
                 :time-grid t  ; Items that appear on the time grid
                 )
          ;; After the last group, the agenda will display items that didn't
          ;; match any of these groups, with the default order position of 99
          ))
  (org-super-agenda-mode)
  ;; (org-agenda nil "a")
  ;; (setq org-agenda-log-mode 1)
  )

(use-package org-appear
  :ensure t
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t)
  )

(use-package org-roam
  :ensure t
  :after org
  :custom
  (org-roam-directory (file-truename "~/org/org-roam"))
  :general
  (:keymaps 'mdrp-org-map
            "r" 'org-roam-buffer-toggle
            "f" 'org-roam-node-find
            "g" 'org-roam-graph
            "i" 'org-roam-node-insert
            "c" 'org-roam-capture
               ;; Dailies
            "j" 'org-roam-dailies-capture-today)
  :config
  ;; If you're using a vertical completion framework, you might want a more informative completion interface
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  (require 'org-roam-protocol))

(use-package org-make-toc
  :ensure t
  :custom
  (org-make-toc-insert-custom-ids t))
