init.org
** Main mode
:PROPERTIES:
:CUSTOM_ID: main-mode
:END:

#+begin_src emacs-lisp
  (use-package lsp-mode
    :hook (
           (tuareg-mode . lsp-deferred)
           (caml-mode . lsp-deferred)
           (elm-mode . lsp-deferred)
           (rustic-mode . lsp-deferred)
           (conf-toml-mode . lsp-deferred)
           (kotlin-mode . lsp-deferred)
           (fsharp-mode . lsp-deferred)
           (python-mode . lsp-deferred))
    :custom
    (lsp-log-io nil)
    (lsp-headerline-breadcrumb-enable t)
    (lsp-headerline-breadcrumb-segments '(project path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-enable-symbol-numbers nil)
    (lsp-modeline-code-actions-enable nil)
    (lsp-keymap-prefix "M-l")
    (lsp-prefer-capf t)
    (lsp-lens-enable nil)
    (lsp-completion-provider :capf)
    (lsp-completion-enable t)
    (lsp-enable-imenu t)
    (lsp-disabled-clients '((python-mode . pyls)))

    ;; Rust-analyzer is the almost official lsp server for Rust
    (lsp-rust-server 'rust-analyzer)
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    ;; enable / disable the hints as you prefer:
    (lsp-rust-analyzer-server-display-inlay-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    (lsp-rust-analyzer-display-parameter-hints nil)
    (lsp-rust-analyzer-display-reborrow-hints nil)
    :commands lsp

    :config
    ;; Temporary solution until https://github.com/emacs-lsp/lsp-mode/pull/3637 is merged
    (defcustom lsp-cut-signature 'space
      "If non-nil, signatures returned on hover will not be split on newline."
      :group 'lsp-ocaml
      :type '(choice (symbol :tag "Default behaviour" 'cut)
                     (symbol :tag "Display all the lines with spaces" 'space)))

    (cl-defmethod lsp-clients-extract-signature-on-hover (contents (_server-id (eql ocaml-lsp-server)) &optional storable)
      "Extract a representative line from OCaml's CONTENTS, to show in the echo area.
  This function splits the content between the signature
  and the documentation to display the signature
  and truncate it if it's too wide.
  The STORABLE argument is used if you want to use this
  function to get the type and, for example, kill and yank it."
      (let ((type (s-trim (lsp--render-element (lsp-make-marked-string
                                                :language "ocaml"
                                                :value (car (s-split "---" (lsp--render-element contents))))))))
        (if (equal nil storable)
            (if (eq lsp-cut-signature 'cut)
                (car (s-lines type))
              ;; else lsp-cut-signature is 'space
              (let ((ntype (s-replace "\n" " " type)))
                (if (>= (length ntype) (frame-width))
                    (concat (substring ntype 0 (- (frame-width) 4)) "...")
                  ntype)))
          type)))

    ;;- end of temporary solution

    (defvar mdrp/type-map
      (let ((keymap (make-sparse-keymap)))
        (define-key keymap (kbd "C-w") #'mdrp/lsp-get-type-and-kill)
        keymap)
      "The local map to navigate type enclosing.")

    (defun mdrp/set-type-map (&rest r)
      (set-transient-map mdrp/type-map)
      )

    (advice-add 'lsp-describe-thing-at-point :after #'mdrp/set-type-map)

    (defun mdrp/lsp-get-type-and-kill ()
      (interactive)
      (let ((contents (-some->> (lsp--text-document-position-params)
                        (lsp--make-request "textDocument/hover")
                        (lsp--send-request)
                        (lsp:hover-contents))))
        (let ((contents (and contents
                             (lsp--render-on-hover-content
                              contents
                              t))))
          (let ((contents
                 (pcase (lsp-workspaces)
                   (`(,workspace)
                    (lsp-clients-extract-signature-on-hover
                     contents
                     (lsp--workspace-server-id workspace)
                     t))
                   (lsp-clients-extract-signature-on-hover
                    contents
                    nil)
                   )))
            (message "Copied %s to kill-ring" contents)
            (kill-new contents)
            ))))
    (which-key-add-keymap-based-replacements lsp-command-map "u" "UI")
    (lsp-enable-which-key-integration t)
    (lsp-register-client
     (make-lsp-client
      :new-connection (lsp-stdio-connection
                       '("opam" "exec" "--" "ocamllsp"))
      :major-modes '(caml-mode tuareg-mode)
      :server-id 'ocaml-lsp-server))
    :general
    ("M-l" 'lsp-command-map)
    ("C-c n"   'flycheck-next-error)
    ("C-c C-t" 'lsp-describe-thing-at-point)
    ("C-c C-w" 'mdrp/lsp-get-type-and-kill)
    ("C-c C-l" 'lsp-find-definition)
    ("C-c &"   'pop-global-mark)
    (:keymaps 'lsp-command-map
              "d"  'lsp-find-definition
              "r"  'lsp-find-references
              "n"  'lsp-ui-find-next-reference
              "p"  'lsp-ui-find-prev-reference
              "i"  'counsel-semantic-or-imenu
              "R"  'lsp-rename
              "tr" 'lsp-treemacs-references
              "ts" 'lsp-treemacs-symbols
              "te" 'lsp-treemacs-error-list
              "f"  'my-lsp-fix-buffer
              ))
#+end_src

** [[https://github.com/emacs-lsp/lsp-ui][Lsp ui]]
:PROPERTIES:
:CUSTOM_ID: lsp-ui
:END:

#+begin_src emacs-lisp
  ;; Useful link : https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/
  (use-package lsp-ui
    :ensure t
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-delay 0.9)
    (lsp-ui-doc-position 'at-point)
    ;; Whether or not to enable the header which displays the symbol string.
    (lsp-ui-doc-header t)
    ;; Whether or not to include the object signature/type in the frame.
    (lsp-ui-doc-include-signature t)
    (lsp-ui-doc-show-with-cursor nil)
    (lsp-ui-doc-show-with-mouse nil)
    ;; Border color of the frame
    (lsp-ui-doc-border (face-foreground 'default))
    ;; Whether or not to enable lsp-ui-sideline
    (lsp-ui-sideline-enable nil)
    ;; Ignore duplicates when there is a same symbol with same contents
    ;; (lsp-ui-sideline-ignore-duplicate t)
    ;; Whether to show code actions in sideline.
    ;; (lsp-ui-sideline-show-code-actions nil)
    :general
    ("C-M-d" 'lsp-ui-doc-show)
    ("C-c i" 'lsp-ui-imenu)
    (:keymaps 'lsp-ui-mode-map
              [remap xref-find-definitions] 'lsp-ui-peek-find-definitions
              [remap xref-find-references] 'lsp-ui-peek-find-references
          )
    (:keymaps 'lsp-command-map
          "u f" 'lsp-ui-doc-focus-frame
          "u i" 'lsp-ui-imenu
          )
    )
#+end_src

** [[https://github.com/emacs-lsp/lsp-treemacs][Lsp treemacs]]
:PROPERTIES:
:CUSTOM_ID: lsp-treemacs
:END:

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :ensure t
    :after lsp
    )
#+end_src

* [[https://github.com/emacs-tree-sitter/elisp-tree-sitter][Tree sitter]]
:PROPERTIES:
:CUSTOM_ID: tree-sitter
:END:

Minor mode that uses tree-sitter, an incremental parsing library. As well as LSP use incremental compilation to give useful informations about programs, tree-sitter use incremental parsing of current buffer to help with syntax highlighting, code folding etc.

# TODO: Use tree-sitter for syntax highlighting instead of font-lock-mode
#+begin_src emacs-lisp
  (use-package tree-sitter-langs :ensure t)

  (use-package tree-sitter
      :ensure t
      :defer t
      :hook
      (tree-sitter-after-on . tree-sitter-hl-mode)
      :config
      ;; This makes every node a link to a section of code
      (setq tree-sitter-debug-jump-buttons t)
      ;; and this highlights the entire sub tree in your code
      (setq tree-sitter-debug-highlight-jump-region t)
      (global-tree-sitter-mode))

    ;; This package needs to be loaded to use language parsers
#+end_src

** Tree sitter folding
:PROPERTIES:
:CUSTOM_ID: tree-sitter-folding
:END:

Code folding based on tree-sitter tree.

#+begin_src emacs-lisp
  (use-package ts-fold
    :load-path "lisp/ts-fold/"
    :hook
    (tuareg-mode . ts-fold-mode)
    (c++-mode    . ts-fold-mode)
    (python-mode . ts-fold-mode)
    (rustic-mode . ts-fold-mode)
    )

  (use-package ts-fold-indicators
    :load-path "lisp/ts-fold/"
    :config
    (setq ts-fold-indicators-fringe 'left-fringe)
    (setq ts-fold-indicators-priority 100)
    :hook
    (tree-sitter-after-on . ts-fold-indicators-mode)
    )

#+end_src

* Programming languages
:PROPERTIES:
:CUSTOM_ID: programming-languages
:END:

** Data/Config formats
:PROPERTIES:
:CUSTOM_ID: dataconfig-formats
:END:

