init.el

(use-package conf-mode
  :ensure nil
  :mode (
         ("/\\.merlin\\'" . conf-mode)
         ("_tags\\'" . conf-mode)
         ("^dune$" . conf-mode)
         ("^dune-project$" . conf-mode)
         ("_log\\'" . conf-mode)
         )
  )

(use-package json-mode
  :mode (("\\.bowerrc$"     . json-mode)
         ("\\.jshintrc$"    . json-mode)
         ("\\.json_schema$" . json-mode)
         ("\\.json\\'" . json-mode))
  :general
  (:keymaps 'json-mode-map
            "C-c <tab>" 'json-mode-beautify
            "<tab>" 'hs-toggle-hiding
            "C-c C-a" 'hs-show-all
            "C-c C-t" 'hs-hide-all
            "C-c C-l" 'hs-hide-level
            )
  :config
  (make-local-variable 'js-indent-level))

(use-package json
  :config
  (defun get-secrets-config-value (key)
    "Return the value of the json file secrets for key"
    (cdr (assoc key (json-read-file "~/.secrets/secrets.json")))
    )
  )

(use-package toml-mode
  :ensure t
  :mode ("\\.toml\\'" . toml-mode)
  :ensure-system-package (taplo . "cargo install taplo-cli")
  )

(use-package dune-mode
  :mode ("^dune$" "^dune-project$")
  )

(use-package make-mode
  :hook (make-mode . semantic-mode)
  )

(use-package elisp-mode
  :hook (elisp-mode . semantic-mode)
  )

(when use-fsharp
  (use-package fsharp-mode
    :init
    (add-to-list 'exec-path (concat (getenv "HOME") "/.dotnet"))
    (add-to-list 'exec-path (concat (getenv "HOME") "/.dotnet/tools"))
    (setenv "PATH"
            (concat
             (concat (getenv "HOME") "/.dotnet")
             ":"
             (concat (getenv "HOME") "/.dotnet/tools")
             ":"
             (getenv "PATH")))
    :defer t
    :ensure t))

(when use-kotlin
  (use-package kotlin-mode
    :ensure t))

(when use-latex
  (use-package tex-site
    :ensure auctex
    :mode ("\\.tex\\'" . latex-mode)
    :config
    (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq-default TeX-master nil)
    (turn-on-reftex)
    (setq reftex-plug-into-AUCTeX t)
    (reftex-isearch-minor-mode)
    (setq TeX-PDF-mode t)
    (setq TeX-source-correlate-method 'synctex)
    (setq TeX-source-correlate-start-server t)
    )

  (use-package auctex-latexmk
    :after tex-site
    :config
    (auctex-latexmk-setup)
    (setq auctex-latexmk-inherit-TeX-PDF-mode t)
    )

  (use-package LaTeX-math-mode
    :hook auctex
    )
  )

(when use-markdown
  (use-package markdown-mode
    :ensure t
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'"       . markdown-mode)
           ("\\.markdown\\'" . gfm-mode))
    :init
    (setq native-comp-deferred-compilation-deny-list '("markdown-mode\\.el$"))
    (setq markdown-command "markdown")
    (setq markdown-open-command "retext")
    :hook (gfm-mode . (lambda ()
                        (setq-local markdown-command "pandoc --metadata title:Title -t html5 --css ~/markdown_css/github-markdown-dark.css -f gfm -s")))
    ))

(when use-markdown
  (use-package markdown-toc
    :ensure t))

(when use-pandoc
  (use-package pandoc-mode
    :ensure-system-package pandoc
    :ensure t
    :hook ((markdown-mode . pandoc-mode)
           (pandoc-mode . pandoc-load-default-settings))))

;; tuareg-mode has the prettify symbols itself
;; (ligature-set-ligatures 'tuareg-mode '(tuareg-prettify-symbols-basic-alist))
;; (ligature-set-ligatures 'tuareg-mode '(tuareg-prettify-symbols-extra-alist))
;; harmless if `prettify-symbols-mode' isn't active
;; (setq tuareg-prettify-symbols-full t)
(defun mdrp/opam-shell-command-to-string (command)
  "Similar to shell-command-to-string, but returns nil unless the process
  returned 0, and ignores stderr (shell-command-to-string ignores return value)"
  (let* ((return-value 0)
         (return-string
          (with-output-to-string
            (setq return-value
                  (with-current-buffer standard-output
                    (process-file shell-file-name nil '(t nil) nil
                                  shell-command-switch command))))))
    (if (= return-value 0) return-string nil)))

(defun mdrp/load-path-opam (&rest _)
  (let ((opam-share
         (let ((reply (mdrp/opam-shell-command-to-string "opam var share --safe")))
           (when reply (substring reply 0 -1)))))
    (message opam-share)
    (let ((path (concat opam-share "/emacs/site-lisp")))
      (message "Path is %s" path)
      path
    )
  ))

(defun mdrp/erase-and-fill-buffer (buffer)
  "Blahblah BUFFER."
  (with-current-buffer buffer
    (erase-buffer)
    (insert "Dune watch buffer")
    ))

;; TODO: This function should be its own package
(defun mdrp/dune-watch (exe)
  "Will call dune build -w EXE on an async process."
  (interactive "sBuild name: ")
  (let ((buffer (get-buffer-create "Dune watch")))
    (add-hook 'before-save-hook (lambda () (mdrp/erase-and-fill-buffer buffer)))
    (with-current-buffer buffer (compilation-minor-mode t))
    (projectile-run-async-shell-command-in-root (concat "dune build -w " exe) buffer)
    ;; Make this process non blocking for killing
    (set-process-query-on-exit-flag (get-buffer-process buffer) nil)
    (display-buffer buffer '((display-buffer-below-selected display-buffer-at-bottom)
                             (inhibit-same-window . t)
                             (window-height . 0.2)))))

(when use-ocaml
  (use-package tuareg
    :ensure t
