init.org
*** [[https://github.com/ocaml/tuareg][Main mode]]
:PROPERTIES:
:CUSTOM_ID: main-mode
:END:

#+begin_src emacs-lisp
  (when use-ocaml
    (use-package tuareg
      :ensure t
      :mode ("\\.ml\\'" . tuareg-mode)
      ;; The following line can be used instead of :ensure t to load
      ;; the tuareg.el file installed with tuareg when running opam install tuareg
      ;; I'm not really sure that it's useful.
      ;; :load-path (lambda () (mdrp/load-path-opam))
      :custom
      (tuareg-other-file-alist
       '(("\\.\\(?:pp\\.\\)?mli\\'" (".ml" ".mll" ".mly" ".pp.ml"))
         ("_intf\\.ml\\'" (".ml"))
         ("\\.\\(?:pp\\.\\)?ml\\'" (".mli" "_intf.ml"))
         ("\\.mll\\'" (".mli"))
         ("\\.mly\\'" (".mli"))
         ("\\.eliomi\\'" (".eliom"))
         ("\\.eliom\\'" (".eliomi"))))
      :general
      (:keymaps 'tuareg-mode-map
                "C-c C-t" nil
                "C-c C-w" nil
                "C-c C-l" nil
                "C-c w"   'mdrp/dune-watch
                )
      :config
      ;; Use opam to set environment
      (setq tuareg-opam-insinuate t)
      (setq tuareg-electric-indent t)

      (tuareg-opam-update-env (tuareg-opam-current-compiler))
      (defun mdrp/update-opam-env (&rest _)
        (when (derived-mode-p 'tuareg-mode)
          (tuareg-opam-update-env nil)
          )
        )

      (defun mdrp/update-load-path-opam (&rest _)
        (when (derived-mode-p 'tuareg-mode)
          (let ((opam-share
                 (let ((reply (mdrp/opam-shell-command-to-string "opam var share --safe")))
                   (when reply (substring reply 0 -1)))))
            (add-to-list 'load-path (concat opam-share "/emacs/site-lisp"))
            )
          )
        )

      (if (boundp 'window-buffer-change-functions)
          (progn
            (add-hook 'window-buffer-change-functions 'mdrp/update-opam-env)
            (add-hook 'window-buffer-change-functions 'mdrp/update-load-path-opam)
            )
        (progn
          (add-hook 'post-command-hook 'mdrp/update-opam-env)
          (add-hook 'post-command-hook 'mdrp/update-load-path-opam)
          ))

      :hook
      (tuareg-mode .
                   (lambda ()
                     ;; Commented symbols are actually prettier with ligatures or just ugly
                     (setq prettify-symbols-alist
                           '(
                             ("sqrt" . ?√)
                             ("&&" . ?⋀)        ; 'N-ARY LOGICAL AND' (U+22C0)
                             ("||" . ?⋁)        ; 'N-ARY LOGICAL OR' (U+22C1)
                             ("<>" . ?≠)
                             ;; Some greek letters for type parameters.
                             ("'a" . ?α)
                             ("'b" . ?β)
                             ("'c" . ?γ)
                             ("'d" . ?δ)
                             ("'e" . ?ε)
                             ("'f" . ?φ)
                             ("'i" . ?ι)
                             ("'k" . ?κ)
                             ("'m" . ?μ)
                             ("'n" . ?ν)
                             ("'o" . ?ω)
                             ("'p" . ?π)
                             ("'r" . ?ρ)
                             ("'s" . ?σ)
                             ("'t" . ?τ)
                             ("'x" . ?ξ)
                             ("fun" . ?λ)
                             ("not" . ?￢)
                             (":=" . ?⟸)
                             ))))))

  (when use-ocaml
    (use-package ocp-indent
      ;; must be careful to always defer this, it has autoloads that adds hooks
      ;; which we do not want if the executable can't be found
      :ensure t
      :hook
      (tuareg-mode . mdrp/ocaml-init-ocp-indent-h)
      :config
      (defun mdrp/ocaml-init-ocp-indent-h ()
        "Run `ocp-setup-indent', so long as the ocp-indent binary exists."
        (when (executable-find "ocp-indent")
          (ocp-setup-indent)))
      ))
#+end_src

*** Tuareg Menhir
:PROPERTIES:
:CUSTOM_ID: tuareg-menhir
:END:

Special tuareg mode when editing ~mly~ files.

#+begin_src emacs-lisp
  (when use-ocaml
    (use-package tuareg-menhir
      :mode ("\\.mly'" . tuareg-menhir-mode)
    ))
#+end_src

*** Dune commands
:PROPERTIES:
:CUSTOM_ID: dune-commands
:END:

#+begin_src emacs-lisp
  (when use-ocaml
    (use-package dune-minor
      :load-path "lisp/"
      :hook (tuareg-mode . dune-minor-mode)))
#+end_src

** [[https://github.com/politza/pdf-tools][Pdf files]]
:PROPERTIES:
:CUSTOM_ID: pdf-files
:END:

In order to use this package you need to run ~M-x pdf-tools-install~ the first time your configuration is loaded.

#+begin_src emacs-lisp
  (use-package pdf-tools
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :magic ("%PDF" . pdf-view-mode)
    :config
    (setq-default pdf-view-display-size 'fit-page)
    ;; Enable hiDPI support, but at the cost of memory! See politza/pdf-tools#51
    (setq pdf-view-use-scaling t
          pdf-view-use-imagemagick nil)
    :hook
    (pdf-view-mode . (lambda () (nlinum-mode 0))))
#+end_src

*** [[https://github.com/nicolaisingh/saveplace-pdf-view][Saveplace in pdf]]
:PROPERTIES:
:CUSTOM_ID: saveplace-in-pdf
:END:

#+begin_src emacs-lisp
  (use-package saveplace-pdf-view
    :ensure t
    :after pdf-view)
#+end_src

** Python
:PROPERTIES:
:CUSTOM_ID: python
:END:

*** [[https://gitlab.com/python-mode-devs/python-mode][Main mode]]
:PROPERTIES:
:CUSTOM_ID: main-mode
:END:

#+begin_src emacs-lisp
  (when use-python
    (use-package python
      :ensure t
      :config
      ;; Remove guess indent python message
      (setq python-indent-guess-indent-offset-verbose nil)
      ;; Use IPython when available or fall back to regular Python
      (cond
       ((executable-find "ipython")
        (progn
          (setq python-shell-buffer-name "IPython")
          (setq python-shell-interpreter "ipython")
          (setq python-shell-interpreter-args "-i --simple-prompt")))
       ((executable-find "python3")
        (setq python-shell-interpreter "python3"))
       ((executable-find "python2")
        (setq python-shell-interpreter "python2"))
       (t
        (setq python-shell-interpreter "python")))
      :hook (python-mode . semantic-mode)))
#+end_src

*** [[https://github.com/jorgenschaefer/pyvenv][Pyvenv]]
:PROPERTIES:
:CUSTOM_ID: pyvenv
:END:
Required to easily switch virtual envs via the menu bar or with ~pyvenv-workon~

Setting the ~WORKON_HOME~ environment variable points at where the envs are located.

#+begin_src emacs-lisp
  (when use-python
    (use-package pyvenv
      :ensure t
      :defer t
      :config
      ;; Setting work on to easily switch between environments
      (setenv "WORKON_HOME" (expand-file-name "~/miniconda3/envs/"))
      ;; Display virtual envs in the menu bar
      (setq pyvenv-menu t)
      ;; Restart the python process when switching environments
      (add-hook 'pyvenv-post-activate-hooks (lambda ()
                                              (pyvenv-restart-python)))
      :hook (python-mode . pyvenv-mode)))
#+end_src

*** [[https://github.com/emacs-lsp/lsp-pyright][Lsp pyright]]
:PROPERTIES:
:CUSTOM_ID: lsp-pyright
:END:

Language server for Python

Read the docs for the different variables set in the config.

#+begin_src emacs-lisp
  (when use-python
    (use-package lsp-pyright
      :ensure t
      :defer t
      :config
      (setq lsp-clients-python-library-directories '("/usr/" "~/miniconda3/pkgs"))
      (setq lsp-pyright-disable-language-service nil
            lsp-pyright-disable-organize-imports nil
            lsp-pyright-auto-import-completions t
            lsp-pyright-use-library-code-for-types t
            lsp-pyright-venv-path "~/miniconda3/envs")
      ))
#+end_src

