init.el
  (defun shell-cmd (cmd)
    "Returns the stdout output of a shell command or nil if the command returned
   an error"
    (car (ignore-errors (apply 'process-lines (split-string cmd)))))

  (defun reason-cmd-where (cmd)
    (let ((where (shell-cmd cmd)))
      (if (not (string-equal "unknown flag ----where" where))
          where)))

  (let* ((refmt-bin (or (reason-cmd-where "refmt ----where")
                        (shell-cmd "which refmt")
                        (shell-cmd "which bsrefmt")))
         (merlin-bin (or (reason-cmd-where "ocamlmerlin ----where")
                         (shell-cmd "which ocamlmerlin")))
         (merlin-base-dir (when merlin-bin
                            (replace-regexp-in-string "bin/ocamlmerlin$" "" merlin-bin))))
    ;; Add merlin.el to the emacs load path and tell emacs where to find ocamlmerlin
    (when merlin-bin
      (add-to-list 'load-path (concat merlin-base-dir "share/emacs/site-lisp/"))
      (setq merlin-command merlin-bin))

    (when refmt-bin
      (setq refmt-command refmt-bin)))

  (use-package reason-mode
    :ensure t
    :config
    (add-hook
     'reason-mode-hook
     (lambda ()
       (add-hook 'before-save-hook 'refmt-before-save)
       (merlin-mode)))))

(when use-rust
  (use-package rustic
    :ensure t
    :mode "\\.rs'"
    ;; :hook (rust-mode . my/rust-mode-outline-regexp-setup)
    :general
    (:keymaps 'rust-mode-map
              "C-c l" 'flycheck-list-errors
              "C-c s" 'lsp-rust-analyzer-status
              "C-M-;" 'rust-doc-comment-dwim-following
              "C-M-," 'rust-doc-comment-dwim-enclosing
              )
    :config
    ;; uncomment for less flashiness
    ;; (setq lsp-eldoc-hook nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-signature-auto-activate nil)
    ;; (defun my/rust-mode-outline-regexp-setup ()
    ;;   (setq-local outline-regexp "///[;]\\{1,8\\}[^ \t]"))
    (defun rust-doc-comment-dwim (c)
      "Comment or uncomment the current line or text selection."
      (interactive)

      ;; If there's no text selection, comment or uncomment the line
      ;; depending whether the WHOLE line is a comment. If there is a text
      ;; selection, using the first line to determine whether to
      ;; comment/uncomment.
      (let (p1 p2)
        (if (use-region-p)
            (save-excursion
              (setq p1 (region-beginning) p2 (region-end))
              (goto-char p1)
              (if (wholeLineIsCmt-p c)
                  (my-uncomment-region p1 p2 c)
                (my-comment-region p1 p2 c)
                ))
          (progn
            (if (wholeLineIsCmt-p c)
                (my-uncomment-current-line c)
              (my-comment-current-line c)
              )))))

    (defun wholeLineIsCmt-p (c)
      (save-excursion
        (beginning-of-line 1)
        (looking-at (concat "[ \t]*//" c))
        ))

    (defun my-comment-current-line (c)
      (interactive)
      (beginning-of-line 1)
      (insert (concat "//" c))
      )

    (defun my-uncomment-current-line (c)
      "Remove “//c” (if any) in the beginning of current line."
      (interactive)
      (when (wholeLineIsCmt-p c)
        (beginning-of-line 1)
        (search-forward (concat "//" c))
        (delete-backward-char 4)
        ))

    (defun my-comment-region (p1 p2 c)
      "Add “//c” to the beginning of each line of selected text."
      (interactive "r")
      (let ((deactivate-mark nil))
        (save-excursion
          (goto-char p2)
          (while (>= (point) p1)
            (my-comment-current-line c)
            (previous-line)
            ))))

    (defun my-uncomment-region (p1 p2 c)
      "Remove “//c” (if any) in the beginning of each line of selected text."
      (interactive "r")
      (let ((deactivate-mark nil))
        (save-excursion
          (goto-char p2)
          (while (>= (point) p1)
            (my-uncomment-current-line c)
            (previous-line) )) ))

    (defun rust-doc-comment-dwim-following ()
      (interactive)
      (rust-doc-comment-dwim "/ "))
    (defun rust-doc-comment-dwim-enclosing ()
      (interactive)
      (rust-doc-comment-dwim "! "))
    ))

(when use-rust
  (use-package cargo
    :ensure t
    :hook (rust-mode . cargo-minor-mode)))

(when use-rust
  (use-package flycheck-rust
    :ensure t
    :hook (rust-mode . flycheck-rust-setup)))

(when use-web
  (use-package web-mode
    :ensure t
    :mode "\\.php\\'"
    ))

(when use-web
  (use-package css-mode
    :ensure nil
    :mode "\\.css\\'"))

(use-package counsel-spotify
  :disabled
  :after ivy
  :init
  (define-prefix-command 'mdrp-spotify-map nil "Spotify-")
  :custom
  (counsel-spotify-client-id (get-secrets-config-value 'spotify-client-id))
  (counsel-spotify-client-secret (get-secrets-config-value 'spotify-client-secret))
  :bind-keymap ("s-x" . mdrp-spotify-map)
  :bind (
         (:map mdrp-spotify-map
               ("q"       . counsel-spotify-previous)
               ("<left>"  . counsel-spotify-previous)
               ("s"       . counsel-spotify-toggle-play-pause)
               ("<down>"  . counsel-spotify-toggle-play-pause)
               ("d"       . counsel-spotify-next)
               ("<right>" . counsel-spotify-next)
               ("z"       . counsel-spotify-play)
               ("<up>"    . counsel-spotify-play)
               )
         )
  )

(setq post-custom-file (expand-file-name "post-custom.el" user-emacs-directory))
(load post-custom-file)

;;;; Footer

;; End:
(provide 'init)

;;; init.el ends here
